{"code": 200, "data": [{"location": "Albania", "data": "Flights to Albania are suspended.\n- This does not apply to flights operated by Air Albania (ZB) from/to Istanbul (IST)."}, {"location": "Azerbaijan", "data": "1. Nationals of China (People's Rep.) are not allowed to enter Azerbaijan if they do not have a visa obtained before departure. \n2. Nationals of Bahrain, Indonesia, Iran, Israel, Japan, Korea (Rep.), Kuwait, Malaysia, Oman, Qatar, Saudi Arabia, Singapore, UAE and USA are not allowed to enter Azerbaijan if they do not have a visa obtained before departure."}, {"location": "Anguilla", "data": "All airports in Anguilla are closed until 20 April 2020."}, {"location": "Armenia", "data": "1. Passengers are not allowed to enter Armenia until 14 May 2020.\n- This does not apply to nationals and residents of Armenia.\n- This does not apply to the immediate family members of nationals of Armenia.\n- This does not apply to diplomats and their immediate family members.\n- This does not apply to airline crew.\n2. Passengers who are allowed to enter Armenia are subject to a 14 day quarantine."}, {"location": "Angola", "data": "1. Passengers and airline crew who have been in China (People's Rep.), France, Iran, Italy, Korea (Rep.), Portugal or Spain are not allowed to enter Angola. This also applies to passengers and airline crew who have been in contact with people infected by the Coronavirus (COVID-19).\n- This does not apply to airline crew and nationals of Angola. \n2. Residents of Angola, airline crew and nationals of Angola who arrive from or have been in China (People's Rep.), France, Iran, Italy, Korea (Rep.), Portugal or Spain will be put in quarantine. \n3. A completed sanitary control sheet must be presented to the National Directorate of Public Health of the Ministry of Health upon arrival."}, {"location": "Argentina", "data": "1. Passengers are not allowed to enter Argentina until 26 April 2020.\n- This does not apply to nationals of Argentina.\n- This does not apply to passengers who reside in Argentina.\n2. Airlines operating repatriation flights must send passenger's information to ANAC 12 hours before departure. This information must contain passenger list with travel document numbers, phone number and address where each person declares that they will comply with the mandatory quarantine upon arrival."}, {"location": "Brunei", "data": "1. Passengers are not allowed to transit or enter Brunei Darussalam.\n\n- This does not apply to nationals and residents of Brunei Darussalam.\n\n2. All visa exemptions and Visa on Arrival are temporarily suspended.\n\n3. All visa issued to passengers are temporarily suspended.\n\n4. Special consideration is only given by the Brunei Immigration Department which is subject to the affairs of interest to Brunei Darussalam by applying to the Brunei Immigration Department by downloading the form provided on the Department’s website at www.immigration.gov.bn"}, {"location": "Algeria", "data": "All international flights to Algeria are suspended."}, {"location": "Ecuador", "data": "1. Ecuador's borders are closed.\n- This does not apply to nationals and residents of Ecuador who are minors traveling without parents or legal tutor, pregnant women, elderly passengers or passengers with disabilities.\n2. Flights to Ecuador are suspended until 30 April 2020. "}, {"location": "Falkland Islands", "data": "1. Passengers are subject to isolation for a period of 14 days if they develop symptoms of Coronavirus (COVID-19). They must contact the local hospital on 28000 for advice.\n2. Passengers who arrive from or have been in Wuhan City or Hubei Province of China (People's Rep.), Iran, Italy, Daegu or Cheongdo of Korea (Rep.), in the past 14 days, and are not a Falkland Islands resident, should not travel to the Falkland Islands. All such arrivals, including local residents, will be interviewed and medically examined on arrival. They will be required to self-isolate for 14 days."}, {"location": "Aruba", "data": "Passengers are not allowed to enter Aruba.\n-This does not apply to residents of Aruba. They must hold an valid Aruban driving license, Aruban ID card or a valid Aruban Health Insurance Card.\n-This does not apply to airline crew.\n-Passengers must apply self-quarantine for 14 days"}, {"location": "Israel", "data": "1. Passengers are not allowed to enter Israel.\n- This does not apply to nationals of Israel.\n- This does not apply to residents of Israel.\n- This does not apply to passengers that have a specific entry approval from the population and Immigration Authority of Israel. \n2.Transit facilities at Tel Aviv (TLV) are temporarily suspended.\n3. All international arrivals will be quarantined at a government-designated facility for a period of 14 days."}, {"location": "Australia", "data": "1. Passengers are not allowed to transit or enter Australia. \n- This does not apply to nationals of Australia. \n- This does not apply to the immediate family members of nationals of Australia. \n- This does not apply to permanent residents of Australia and their immediate family members. \n- This does not apply to nationals of New Zealand residing in Australia. \n- This does not apply to airline crew.\n- This does not apply to diplomats accredited to Australia and currently resident in Australia, and their immediate family members.\n- This does not apply to nationals of Fiji, Kiribati, Marshall Isl., Micronesia (Federated States), Nauru, New Zealand, Niue, Palau, Papua New Guinea, Samoa (American), Solomon Isl., Tonga, Tuvalu and Vanuatu when they are transiting through Australia to their home country.\n- This does not apply to passengers who reside in Cook Isl., French Polynesia or New Caledonia when they are transiting through Australia to their home country. \n2. All passengers are required to self-isolate for a period of 14 days at their first arrival location in Australia. If their duration of stay is less than 14 days, they must self-isolate for the entire duration of stay.\n- This does not apply to airline crew with the appropriate personal protective equipment. \n3. Nationals of Australia are not allowed to travel out of Australia.\nThis does not apply to the following:\n- Persons ordinarily resident in a country other than Australia; \n- Airline and maritime crew and associated safety workers;\n- Persons engaged in the day to day conduct of outbound and inbound freight;\n- Persons whose travel is associated with essential work at offshore facilities; and\n- Persons travelling on official government business, including members of the Australian Defence Force."}, {"location": "Barbados", "data": "Barbados (BGI) is closed until 3 May 2020. \n- This does not apply to Medevac flights, technical stops, and authorized flights, e.g. humanitarian aid."}, {"location": "Burkina Faso", "data": "Bobo Dioulasso (BOY) and Ouagadougou (OUA) are closed."}, {"location": "Benin", "data": "Passengers who have been in coronavirus (COVID-19) affected countries are subject to self-quarantine for 14 days."}, {"location": "Bermuda", "data": "1. Flights to Bermuda are suspended until 1 May 2020.\n2. Passengers will be required to self-quarantine for 14 days.\n- This does not apply to airline crew. "}, {"location": "Bolivia", "data": "1. Passengers are not allowed to enter Bolivia until 30 April 2020.\n- This does not apply to nationals of Bolivia and residents of Bolivia.\n- This does not apply to passengers who are in a diplomatic mission.\n2. Flights from Europe to Bolivia are suspended until 30 April 2020. "}, {"location": "Montserrat", "data": "Passengers are not allowed to enter Montserrat.\n- This does not apply to passengers from Montserrat;\n- This does not apply to passengers who have a permit of permanent residence;\n- This does not apply to airline crew;\n- This does not apply to husband, wife, child or other dependents of a person who is from or reside in Montserrat."}, {"location": "Bahamas", "data": "Bahamas borders are closed."}, {"location": "Belize", "data": "1. Passengers arriving from Europe, China (People's Rep.), Hong Kong (SAR China), Iran, Japan, Korea (Rep.) are not allowed to enter Belize.\n\n   -This does not apply to nationals and residents of Belize.\n\n2. Nationals of China (People's Rep.), Hong Kong (SAR China), Iran, Japan, Korea (Rep.) and nationals of European countries are not allowed to enter Belize.\n\n3. Nationals of Belize arriving from China (People's Rep.), Hong Kong, Iran, Japan, Korea (Rep.) or Europe are required to self-isolate for a period of 14 days.\n\n   -This does not apply to airline crew.\n\n4. Residents of Belize arriving from China (People's Rep.), Hong Kong (SAR China), Iran, Japan, Korea (Rep.) or Europe are required to self-isolate for a period of 14 days."}, {"location": "Congo, the Democratic Republic of the", "data": "All airports in Congo are closed."}, {"location": "Congo", "data": "All airports in Congo are closed."}, {"location": "Cote d'Ivoire", "data": "Cote d'Ivoire borders are closed."}, {"location": "Cook Islands", "data": "Passengers who have transited or been in any country except for Cook Isl. and New Zealand in the past 14 days are not allowed to enter Cook Isl."}, {"location": "Chile", "data": "1. Passengers are not allowed to enter Chile until 24 April 2020.\nThis does not apply to:\n- Nationals of Chile;\n- Residents of Chile;\n- Passengers bringing humanitarian help;\n- Passengers with a diplomatic visa and an official ID issued by the Ministry of Foreign Affairs of Chile;\n- Passengers with a safe-conduct.\n2. Nationals and residents of Chile will be quarantined for 14 days."}, {"location": "Cameroon", "data": "All international flights to Cameroon are suspended."}, {"location": "Indonesia", "data": "1. Passengers are not allowed to transit or enter Indonesia.\n- This does not apply to nationals of Indonesia.\n- This does not apply to passengers with a Temporary Stay Permit (ITAS) or Permanent Stay Permit (ITAP).\n- This does not apply to airline crew.\n- This does not apply to the following passengers:\na. passengers with a Diplomatic Visa or Service Visa.\nb. passengers with a Diplomatic Stay Permit or Service Stay Permit.\nc. medical Aid Workers or Food Sustenance Workers for Humanitarian Purposes.\nd. foreigners/Expatriates working on strategic national projects.\n2. Passengers who are eligible to enter Indonesia (except nationals of Indonesia) must comply with the following requirements:\n- have a valid health certificate in English issued by Health Authority from respective country. It must be valid within 7 days and state the passenger is free from respiratory disease, and\n- have no travel history in the last 14 days from China (People's Rep.), France, Germany, Iran, Italy, Korea (Rep.), Spain, Switzerland, United Kingdom and Vatican City (Holy See), and\n- agree for self-quarantine for 14 days and fill in statement of compliance on arrival."}, {"location": "Malta", "data": "Flights to Malta are suspended until 24 April 2020.\n- This does not apply to ferry flights, humanitarian flights and repatriation flights."}, {"location": "Colombia", "data": "1.      Passengers are not allowed to enter Colombia.\n\n2.      This does not apply to nationals of Colombia and passengers who reside in Colombia. They will be required to self-isolate for 14 days.\n\n3.      This does not apply to passengers who are in a diplomatic mission. They will be required to self-isolate for 14 days."}, {"location": "Germany", "data": "1.Passengers are not allowed to enter Germany.\n-This does not apply to:\n- nationals of Germany;\n- passengers with permanent residence in Germany obtained before Coronavirus (COVID-19) or with a D-Visa issued by Germany;\n- passengers with evidence that their travel is to perform a professional activity, e.g., commuters, diplomats, nursing staff, food industry personnel, specialists;\n- passengers in transit to their home country, if there is no other travel option. The purpose of travel and the entry requirements for the destination and transit countries must be proved.\n2. Passengers allowed to enter Germany must self-isolate and must proceed directly to their own home, or other suitable accommodation for a period of 14 days."}, {"location": "Djibouti", "data": "Flights to Djibouti are suspended."}, {"location": "Dominica", "data": "1.Passengers are not allowed to enter Dominica.\n-This does not apply to nationals of Dominica who will be placed in a 14-day mandatory quarantine. \n2.Airline crew is not allowed to disembark."}, {"location": "Dominican Republic", "data": "Flights to Dominican Rep. are suspended until 12 April 2020."}, {"location": "Northern Mariana Islands", "data": "1. Passengers arriving in Saipan from a country with an identified COVID-19 outbreak, inclusive of Guam, Hawaii, and the continental USA, will be required to quarantine for 14 consecutive days at a hotel property. This applies to both residents and non-residents. \n\n2. Passengers who need to leave the island prior to the 14-day period will be allowed to depart back to Guam.  \n\n3. Passengers will complete a health form prior to landing in Saipan. Public Health will meet the passengers in the terminal prior to arrival at the customs hall. Passengers will then proceed to the bus where they will be taken to a hotel property for quarantine.\n\n4. Airline crew, with return flights within less than 14 days of arrival will be allowed to depart Northern Mariana Isl. \n\n5. Passengers entering into the Northern Mariana Isl. by air transport, whose ultimate destination is the island of Tinian or the island of Rota, shall exercise the 14-day quarantine on the island of Saipan before traveling to Tinian or Rota. "}, {"location": "Costa Rica", "data": "1. Passengers are not allowed to enter Costa Rica.\n- This does not apply to nationals of Costa Rica.\n- This does not apply to passengers who reside in Costa Rica.\n2. Nationals and residents of Costa Rica will be required to be in isolation for a period of 14 days."}, {"location": "Cuba", "data": "Flights to Cuba are suspended.\n- This does not apply to humanitarian flights."}, {"location": "Curaçao", "data": "Passengers are not allowed to enter Curacao until 26 April 2020.\nThis does not apply to: \n- Airline crew.\n- Medical specialist and other medical personnel if authorized by the Government of Curacao. These passengers must have a verification letter from the government of Curacao proving they are allowed to enter Curacao.\n- Persons deemed necessary or specifically approved by the Government of Curacao. These passengers must have a verification letter from the government of Curacao proving they are allowed to enter Curacao."}, {"location": "Cyprus", "data": "1. Passengers are not allowed to enter Cyprus.\n- This does not apply to nationals of Cyprus and passengers who reside in Cyprus.\n- This does not apply to passengers who are in a diplomatic mission.\n- This does not apply to passengers with a special authorization issued by the competent ministry of Cyprus.\n- This does not apply to passengers attending educational institutions in Cyprus.\n2. Nationals and residents of Cyprus must have a certificate of health stating they are free from COVID-19 issued within a maximum of 4 days before departure. They will be quarantined for 14 days. \n3. Passengers who are in a diplomatic mission must have a certificate of health stating they are free from COVID-19 issued within a maximum of 4 days before departure. They will be quarantined for 14 days.\n4. Passengers who have a special authorization issued by the competent ministry of Cyprus or are attending educational institutions in Cyprus, must have a certificate of health stating they are free from COVID-19 issued within a maximum of 4 days before departure. They will be quarantined for 14 days."}, {"location": "Eritrea", "data": "Asmara International Airport (ASM) is closed."}, {"location": "Grenada", "data": "Maurice Bishop International Airport (GND) and Lauriston Airport (CRU) are closed for all passenger traffic."}, {"location": "Ethiopia", "data": "Effective 23 March 2020, all passengers arriving in Ethiopia will be placed in a mandatory quarantine at the Ethiopian Skylight Hotel for 14 days at their own expense."}, {"location": "Antigua and Barbuda", "data": "1. Passengers and airline crew who have been in Austria, Belgium, Bulgaria, Canada, China (People's Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, USA or United Kingdom in the past 28 days are not allowed to enter Antigua and Barbuda.\n- This does not apply to nationals of Antigua and Barbuda and resident diplomats. \n2. Airlines must provide advance passenger information of scheduled arrival of nationals of Antigua and Barbuda and resident diplomats."}, {"location": "Botswana", "data": "1. Passengers arriving from Austria, Belgium, China (People's Rep.), Denmark, France, Germany, India, Iran, Italy, Japan, Korea (Rep.), Netherlands, Norway, Spain, Sweden, Switzerland, USA or United Kingdom are not allowed to enter Botswana.\n- This does not apply to nationals of Botswana.\n- This does not apply to passengers who reside in Botswana.\n2. Nationals and residents of Botswana will be quarantined for 14 days.\n3. Passengers can no longer obtain a visa on arrival in Botswana.. \n4. Visas issued to nationals of Austria, Belgium, China (People's Rep.), Denmark, France, Germany, India, Iran, Italy, Japan, Korea (Rep.), Netherlands, Norway, Spain, Sweden, Switzerland or USA are invalidated.\n5. Visas issued to passengers with a British passport with nationality \"British Citizen\" are invalidated."}, {"location": "Kenya", "data": "1. All international flights to Kenya are suspended until 5 May 2020.\n- This does not apply to:\na. Aircraft in state of emergency.\nb. Technical stops where passengers do not disembark.\nc. Operations related to humanitarian aid, medevac, repatriation and diplomatic flights approved by appropriate authorities.\n2. All crew (except those from domestic flights) will have to self-isolate within designated airport hotels at the Nairobi Jomo Kenyatta International Airport for the duration of their rest period.\n3. All approved flights must provide a completed passengers declaration forms and manifests to Port Health, Immigration and customs."}, {"location": "Kyrgyzstan", "data": "Flights to Kyrgyzstan are suspended."}, {"location": "Fiji", "data": "1. Passengers and airline crew are not allowed to enter Fiji. \n- This does not apply to nationals of Fiji.\n2. Nationals of Fiji must go into quarantine for a period of 14 days."}, {"location": "France", "data": "1. Passengers arriving from a non-Schengen Member State are not allowed to enter France. \n- This does not apply to nationals of France.\n- This does not apply to nationals of an EEA Member States or Switzerland on their way home. \n- This does not apply to passengers with residence permit issued by France.\n- This does not apply to passengers with a residence permit issued by an EEA Member States, Switzerland or the United Kingdom on their way home. \n- This does not apply to healthcare professionals, health researchers related to Coronavirus (Covid-19).\n2. Passengers must have an International Circulation Attestation to transit or enter France."}, {"location": "Mongolia", "data": "1. Passengers are not allowed to enter Mongolia until 30 April 2020.\n- This does not apply to nationals of Mongolia. \n- This does not apply to residents of Mongolia who are direct family members of a national of Mongolia.\n- This does not apply to accredited staff and their direct family members of diplomatic missions and offices of international organizations in Mongolia. \n- This does not apply to international freight transport drivers and railway train personnel of Mongolia, Russian Fed. and China (People's Rep.). \n2. Nationals of Mongolia will be placed in quarantine for 14 days. \n3. Residents of Mongolia who are direct family members of a national of Mongolia will be placed in quarantine for 14 days.\n4. Accredited staff and their direct family members of diplomatic missions and offices of international organizations in Mongolia will be quarantined for 21 days at designated facilities upon arrival. After the quarantine period ends, they shall be under self-isolation at home for 14 days."}, {"location": "Gabon", "data": "Passengers who have been in Austria, Belgium, Bulgaria, China (People’s Rep.), Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Italy, Ireland (Rep.), Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Spain, Slovakia, Slovenia, Sweden, Switzerland, USA or the United Kingdom in the last 14 days are not allowed to enter Gabon.\n\n- This does not apply to nationals and residents of Gabon."}, {"location": "Brazil", "data": "Passengers are not allowed to enter Brazil until 30 April 2020. This does not apply to:\n- Nationals of Brazil;\n- Passengers who reside in Brazil;\n- Foreign professionals in a mission in the service of an international body, if it is duly identified;\n- Foreign employee accredited to the Brazilian Government;\n- Immediate family member of a national of Brazil;\n- Passengers with an authorization issued by Brazilian Government;\n- Passengers with a National Migration Registry;\n- Technical landing to refuel where passengers of restricted nationalities are not disembarking;\n- Passenger in international transit if they do not leave the international area of the airport and the country of destination admits their entry."}, {"location": "Honduras", "data": "1. Passengers are not allowed to enter Honduras. \n- This does not apply to nationals and residents of Honduras. \n- This does not apply to members of the diplomatic corps. \n2. Nationals and residents of Honduras can only land at San Pedro Sula (SAP) or Tegucigalpa (TGU). \n3. Passengers who are members of the diplomatic corps can only land at San Pedro Sula (SAP) or Tegucigalpa (TGU). \n4. Nationals and residents of Honduras are required to self-isolate for 14 days. \n5. Passengers who are members of the diplomatic corps are required to self-isolate for 14 days."}, {"location": "South Korea", "data": "1. Short-term visas (type C-1 and C-3) issued on or before 5 April are invalidated.\n2. Visa exemptions for 90 nationalities with normal passport are temporarily suspended.\n- This does not apply to airline crew.\n- This does not apply to passengers with an APEC Business Travel Card. \n3. Korean visas issued by the Wuhan Consulate in the Hubei Province are invalidated.\n4. Visitors who have been in the Hubei Province (China People's Rep.) in the past 14 days are not allowed to transit or enter Korea (Rep.). \n5. Nationals of China (People's Rep.) with a passport issued in the Hubei Province are not allowed to transit or enter Korea (Rep.).\n6. Passengers arriving from China (People's Rep) must have a visa issued by Korea (Rep.) to transit through Korea (Rep.). \n- This not apply to nationals of Albania, Andorra, Barbados, Dominica, Guyana, Ireland (Rep.), Korea (Rep.), Malta, Mexico, Monaco, Nicaragua, Palau, San Marino, Slovenia, St. Kitts and Nevis, St. Vincent and the Grenadines, USA, Vatican City (Holy See) and Venezuela. \n- This not apply to passengers with a British passport.\n- This does not apply to passengers with a diplomatic, consular, official, service or special passport. \n7. All passengers are subject to mandatory self-quarantine for 14 days. \n- This does not apply to airline crew. \n8. Nationals and residents of Korea (Rep.) are required to install 'Self-quarantine safety protection mobile app'. \n9. Passengers and airline crew must install 'Self-diagnosis Mobile App' in their personal device and a completed Health Declaration Form and a Special Quarantine Declaration Form must be presented to the quarantine desk upon arrival.\n10. All flights must arrive at Incheon International Airport (ICN) between 5:00 and 20:00."}, {"location": "Egypt", "data": "Flights to Egypt are suspended.\n- This does not apply to humanitarian, repatriation and United Nations flights with a pre-authorization from the Egyptian Civil Aviation Authority."}, {"location": "Mauritania", "data": "1. Passengers are not allowed to transit or enter Mauritius.\n- This does not apply to nationals of Mauritius, their spouses and children. They will be placed in quarantine.\n- This does not apply to residents of Mauritius, their spouses and children. They will be placed in quarantine.\n2. Airline crew will be isolated in their hotel rooms."}, {"location": "Micronesia, Federated States of", "data": "1. Passengers traveling to the state of Chuuk must be self-quarantined for 14 days in COVID-19 free country before departure.\n2. Passengers and airline crew must go thorough medical screening upon arrival. \n3. Passengers are not allowed to enter the state of Pohnpei.\n- This does not apply to residents of Pohnpei.\n- This does not apply to medical and technical personnel.\n4. Passengers traveling to the state of Pohnpei must have a medical certificate and must be quarantined for 14 days.\n5. Passengers traveling to the state of Chuuk will be quarantined for 14 days."}, {"location": "Ghana", "data": "1. Flights to Ghana are suspended until 19 April 2020.\n- This does not apply to emergency flights, humanitarian flights, technical landing for refuel and medical evacuation flights.\n2. Airline crew will undergo strict mandatory quarantine during their rotation/rest period."}, {"location": "Guatemala", "data": "1. Passengers are not allowed to enter Guatemala.\n- This does not apply to nationals and residents of Guatemala. \n- This does not apply to accredited diplomats. \n2. Nationals and residents of Guatemala must be in quarantine. \n3. Accredited diplomats must be in quarantine. \n4. Flights to Guatemala are suspended until 30 April 2020."}, {"location": "Guam", "data": "Passengers will be quarantined for a period of 14 days upon arrival. \n- This does not apply to passengers with a healthcare recognized and certified document which confirms that they are not infected with COVID-19 within\nthe last 72 hours."}, {"location": "Guyana", "data": "Airports in Guyana are closed to all international passenger flights until 1 May 2020.\n- This does not apply to nationals and residents of Guyana.\n- This does not apply to:\na. Urgent health condition motive;\nb. Professional trips which cannot be deferred as authorized;\nc. Medivac flights;\nd. Technical stops for fuel only and special authorized flights."}, {"location": "Mauritius", "data": "Passengers are not allowed to enter Mauritius until 2 April 2020, 6:00GMT.\n- This does not apply to nationals of Mauritius, their spouses and children. They will be placed in quarantine"}, {"location": "Bulgaria", "data": "1. Passengers not arriving from Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, Greece, Hungary, Latvia, Lithuania, Malta, Norway, Poland, Portugal, Romania, Slovakia, Slovenia or Sweden are not allowed to enter Bulgaria. \n- This does not apply to nationals of Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, Greece, Hungary, Latvia, Lithuania, Malta, Norway, Poland, Portugal, Romania, Slovakia, Slovenia and Sweden. \n- This does not apply to family members of nationals of Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, Greece, Hungary, Latvia, Lithuania, Malta, Norway, Poland, Portugal, Romania, Slovakia, Slovenia and Sweden.\n- This does not apply to passengers and their families with a permanent or long term residence permit issued by Bulgaria. \n- This does not apply to nationals of Austria, Belgium, France, Germany, Iceland, Ireland (Rep.), Italy, Liechtenstein, Luxembourg, Netherlands, Spain and Switzerland and their family members when they transit through Bulgaria to return to their country of residence. \n- This does not apply to passengers with a British passport and their family members when they transit through Bulgaria to return to their country of residence. \n- This does not apply to nationals and residents of Turkey when they transit through Bulgaria to return to their country of residence. \n- This does not apply to nationals and residents of North Macedonia (Rep.) when they transit through Bulgaria to return to their country of residence.\n- This does not apply to nationals and residents of Serbia when they transit through Bulgaria to return to their country of residence. \n- This does not apply to nationals and residents of Montenegro when they transit through Bulgaria to return to their country of residence.\n- This does not apply to the following passengers:\na. health care professionals, health researchers and elderly care professionals;\nb. transport personnel engaged in the carriage of goods, crews of aircraft engaged in commercial air transport and other transport personnel as necessary;\nc. diplomats, officials of international organizations, military personnel and humanitarian workers in the performance of their duties;\nd. persons traveling for humanitarian reasons; third-country nationals who hold a long-term residence permit in an EU Member State and pass through Bulgaria in order to return to their country of residence and residence.\n2. Nationals of Bulgaria arriving from risky countries are requested to observe a 14-day quarantine period.\n3. All arriving passenger from Italy at Sofia airport (SOF) must fill out a questionnaire in the presence of a health inspector."}, {"location": "Haiti", "data": "All flights to Port Au Prince International airport and Tocap Haitian International airport are suspended. \n- This does not apply to domestic, emergency, humanitarian, medevac and government flights."}, {"location": "Hungary", "data": "Hungary's borders are closed.\n- This does not apply to nationals of Hungary and EEA nationals with a residence permit issued by Hungary."}, {"location": "India", "data": "Flights to India are suspended until 3 May 2020.\n- This does not apply to flights that carry goods for trade or essential goods and supplies, and their crew members, helpers, cleaners etc."}, {"location": "Iraq", "data": "All airports in Iraq are closed until 18 April 2020."}, {"location": "Iran, Islamic Republic of", "data": "1. Nationals of China (People's Rep.) with a normal passport, passengers with a Hong Kong (SAR China) passport and passengers with a Macao (SAR China) passport are no longer visa exempt. However, they can obtain a visa on arrival.\n\nThey are required to clear the medical and health check upon arrival. After that they will be given a certificate.\n\n2. Based on the travel advisory restriction issued by United Arab Emirates Government, nationals of United Arab Emirates are not allowed to travel to Iran."}, {"location": "Jamaica", "data": "1. Passengers are not allowed to enter Jamaica.\n- This does not apply to passengers with an authorization issued by the government of Jamaica.\n2. Passengers with an authorization issued by the government of Jamaica will be quarantined for 14 days."}, {"location": "Jordan", "data": "Flights to Jordan are suspended until 27 April 2020.\n- This does not apply to:\na. Emergency, humanitarian, medevac, repatriation, United Nations and state/diplomatic flights.\nb. Technical stops where crew and passengers do not disembark."}, {"location": "Japan", "data": "1. Passengers who have been in Albania, Armenia, Australia, Bahrain, Bolivia, Bosnia and Herzegovina, Brazil, Brunei Darussalam, Bulgaria, Canada, Chile, China (People's Rep.), Chinese Taipei, Congo (Dem. Rep.), Cote d'Ivoire, Croatia, Cyprus, Czechia, Dominica, Ecuador, Egypt, Finland, Greece, Hong Kong (SAR China), Hungary, Israel, Indonesia, Korea (Rep.), Kosovo (Rep.), Latvia, Lithuania, Macao (SAR China), Malaysia, Mauritius, Moldova (Rep.), Morocco, Montenegro, New Zealand, North Macedonia, Panama, Philippines, Poland, Romania, Serbia, Singapore, Slovakia, Thailand, Turkey, USA, United Kingdom or Viet Nam in the past 14 days are not allowed to enter.\n- This does not apply to nationals of Japan.\n- This does not apply to spouses or children of nationals of Japan if they can prove it.\n- This does not apply to residents of Japan with “Permanent Resident\" or “Long Term Resident\", who have departed Japan with Re-entry Permission by 2 April 2020.\n- This does not apply to passengers with a Special Permanent Residence Permit. However, they must have a Re-entry Permit from a regional immigration officer.\n- This does not apply to US military personnel.\n- This does not apply to airline crew if they comply with the following requirements:\n(a) each crewmember must submit a quarantine questionnaire;\n(b) each crewmember must submit and a \"Plan of Stay in Japan\" declaration;\n(c) crews should adhere to the instructions provided in the quarantine document \"Notice: For Crews boarding vehicles from areas subject to strengthened quarantine\";\n(d) airlines should arrange chartered vehicles (as opposed to public transportation) to transport crews between the airport and their hotel; and \n(e) airlines should ensure that crews comply with items (a) through (d) above during their stay in Japan.\n2. Passengers and airline crew who have been in Albania, Andorra, Armenia, Australia, Austria, Bahrain, Belgium, Bolivia, Bosnia and Herzegovina Brazil, Brunei Darussalam, Bulgaria, Canada, China (People's Rep.), Chinese Taipei, Chile, Congo (Dem. Rep.), Cote d'lvoire, Croatia, Cyprus, Czechia, Denmark, Dominica, Ecuador, Egypt, Estonia, Finland, France, Germany, Greece, Hong Kong (SAR China), Hungary, Iceland, Indonesia, Iran, Ireland (Rep.), Israel, Italy, Korea (Rep.), Kosovo (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Mauritius, Monaco, Montenegro, Malaysia, Moldova, Morocco, Netherland, New Zealand, North Macedonia, Norway, Panama, Philippines, Poland, Portugal, Romania, San Marino, Serbia, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, Turkey, Vatican City (Holy See), Viet Nam, USA or United Kingdom in the past 14 days must submit a quarantine questionnaire upon arrival.\n3. Passengers who have been in Andorra, Austria, Belgium, Denmark, Estonia, France, Germany, Iceland, Iran, Ireland (Rep.), Italy, Liechtenstein, Luxembourg, Malta, Monaco, Netherlands, Norway, Portugal, San Marino, Slovenia, Spain, Sweden, Switzerland or Vatican City (Holy See) in the past 14 days are not allowed to enter Japan.\n- This does not apply to nationals of Japan. \n- This does not apply to spouses or children of nationals of Japan if they can prove it.\n- This does not apply to passengers with a Special Permanent Residence Permit. However, they must have a Re-entry Permit from a regional immigration officer.\n- This does not apply to US military personnel.\n4. Visas issued on or before 2 April 2020 by the Embassies, Consulates-General and Consulate of Japan located outside Albania, Armenia, Australia, Bahrain, Bolivia, Bosnia and Herzegovina, Brazil, Brunei Darussalam, Bulgaria, Canada, Chile, China (People's Rep.), Chinese Taipei, Congo (Dem. Rep.), Cote d'Ivoire, Croatia, Cyprus, Czechia, Dominica, Ecuador, Egypt, Finland, Greece, Hong Kong (SAR China), Hungary, Korea (Rep.), Kosovo (Rep.), Israel, Indonesia, Latvia, Lithuania, Macao (SAR China), Malaysia, Mauritius, Moldova (Rep.), Morocco, Montenegro, New Zealand, North Macedonia, Panama, Philippines, Singapore, Slovakia, Serbia, Thailand, Poland, Romania, Turkey, United Kingdom, USA and Viet Nam, are invalidated.\n5. Visa exemption for passengers with passengers with a British passport, Hong Kong (SAR China) passport, Macao (SAR China) passport is suspended.\n6. Visa exemption for nationals of Andorra, Argentina, Austria, Bahamas, Barbados, Belgium, Brunei Darussalam, Bulgaria, Costa Rica, Croatia, Czechia, Cyprus, Denmark, Dominican Rep., El Salvador, Estonia, Finland, France, Germany, Greece, Guatemala, Honduras, Hungary, Iceland, Indonesia, Iran, Ireland (Rep.), Israel, Italy, Korea (Rep.), Latvia, Lesotho, Liechtenstein, Lithuania, Luxembourg, Malaysia, Malta, Mexico, Monaco, Netherlands, Norway, Peru, Poland, Portugal, Romania, San Marino, Singapore, Slovakia, Slovenia, Spain, Suriname, Sweden, Switzerland, Thailand, Tunisia, United Arab Emirates, Uruguay and Vatican City (Holy See) is suspended.\n7. Visa exemption for nationals of Azerbaijan, Bangladesh, Cambodia"}, {"location": "Iceland", "data": "1.Passengers are not allowed to enter Iceland until 15 May 2020. \nThis does not apply to nationals of EEA Member States and Switzerland.\nThis does not apply to passengers with a British passport. \nThis does not apply to passengers with a residence permit issued by a Schengen Member State.\nThis does not apply to:\n- family members of nationals of EEA Member States, Switzerland and of British nationals;\n- diplomats;\n- health and care workers traveling on duty;\n- humanitarian aid workers;\n- international organizations personnel;\n- passengers that require international protection; \n- passengers traveling on family emergencies;\n- members of armed forces traveling on duty. \n2.Passengers listed in above exemptions who intent to travel through Iceland on their way to another Schengen Member State must have a written confirmation of their permission to enter the other Schengen Member State.\n3.Returning nationals and residents of Iceland must undergo quarantine for 14 days."}, {"location": "Philippines", "data": "1. Passengers who have transited through or have been in China (People’s Rep.), Hong Kong (SAR China) or Macao (SAR China) in the past 14 days are not allowed to enter the Philippines. \n- This does not apply to nationals of the Philippines. They will be required to self-isolate for a period of 14 days from their arrival into the Philippines.\n- This does not apply to spouses or children of nationals of the Philippines. They will be required to self-isolate for a period of 14 days from their arrival into the Philippines.\n- This does not apply to permanent residents of the Philippines. They will be required to self-isolate for a period of 14 days from their arrival into the Philippines.\n2.Passengers who have transited through or have been in the North Gyeongsang Province (including Daegu and Cheongdo Country) of Korea (Rep.) in the past 14 days are not allowed to enter the Philippines. \n- This does not apply to nationals of the Philippines. \n- This does not apply to spouses or children of nationals of the Philippines. \n- This does not apply to permanent residents of the Philippines. \n3. Passengers who have transited through or have been in Iran or Italy in the past 14 days are required to present a Medical Clearance or Health Declaration Certificate, issued by Health Authority within 48 hours prior to arrival and certifying that the passenger is free from Coronavirus (COVID-19).\n- This does not apply to nationals of the Philippines. \n- This does not apply to spouses or children of nationals of the Philippines. \n- This does not apply to permanent residents of the Philippines. \nPassengers who have transited through or have been in Iran or Italy in the past 14 days, are required to undergo a 14-day quarantine.\nEffective 22 March 2020, passengers under the following visa categories are not allowed to enter the Philippines:\n- Passengers under Visa Waiver Agreements.\n- Passengers with Special Visas\n- Passengers who fall under Executive Order No.408, s1960 (EO408);\n- Passengers with a Hong Kong (SAR China) passport, Macao (SAR China) passport, Macao-Portuguese, and British National Overseas passports.\n- Immigrant and non-Immigrant visa holders (i.e. 13, 9D, 9F, 9G, 47a(2), etc.)\nThis does not apply to:\n- Foreign spouses and children of Filipino nationals (if they are not traveling together, they should show proof of marriage or filiation).\n- Foreign government and International Organization officials whose visas were issued by the Philippines government.\n- Foreign crew members."}, {"location": "Switzerland", "data": "1. Passengers are not allowed to enter Switzerland.\n- This does not apply to nationals or residents of Switzerland or Liechtenstein.\n- This does not apply to passenger with a cross-border commuter permit who are entering Switzerland for work, with a C-visa issued by Switzerland for the purpose of \"business meetings\" as specialists in the field of health or \"official visit\" of great importance, with a D-visa issued by Switzerland or who have an assurance of a residence permit.\n-This does not apply to passengers traveling directly through Switzerland to another country that they are permitted to enter.\n- This does not apply to passengers who are entitled to freedom of movement and have a professional reason for entering Switzerland and have a confirmation of registration.\n- This does not apply to passengers who are of great importance as specialists in the health sector.\n- This does not apply to passengers travelling by land to their country of origin or residency within the European Union or Schengen area. They must have a proof of onward journey.\n2. Passengers can only land at Basel (BSL), Geneva (GVA) or Zurich (ZRH)."}, {"location": "Comoros", "data": "Passengers who have transited or have been in China (People's Rep.), Egypt, France, Iran, Italy, Morocco, South Africa, Spain or Tunisia are not allowed to enter Comoros."}, {"location": "Samoa", "data": "1. Nationals of the USA and residents of Samoa (American) who transited or have been in Arizona, California, Florida, Georgia, Hawaii, Illinois, Massachusetts, New Hampshire, New York, North Carolina, Oregon, Rhode Island, Texas, Washington or Wisconsin, are subject to Public Health screening and might be medically or home quarantined.\n\n2. Entry Permits, issued by Samoa (American) instead of visas, are suspended.\n\n- This does not apply to residents of Samoa (American) with residence permit or an Immigration Board approval.\n\n3. Passengers arriving from Samoa must:\n\n- obtain a health clearance from Ministry of Health (MOH) 3 days prior to arrival;\n\n- present a completed “DOT Travel Declaration Form” upon arrival.\n\n4. Passengers who transited or have been in countries affected by Coronavirus (COVI-19), when arriving from Hawaii, must:\n\n-spend 14 days in Hawaii; and\n\n-obtain a health clearance 3 days before arrival in Samoa (American); and\n\n-present a completed “DOT Travel Declaration Form” upon arrival; and\n\n-provide itinerary upon arrival.\n\n5. Flights from Tonga with Talofa Airways are suspended."}, {"location": "Laos", "data": "Flights to Lao People's Dem. Rep. are suspended until 3 May 2020."}, {"location": "Saint Kitts and Nevis", "data": "Airports in St. Kitts and Nevis are closed."}, {"location": "North Korea", "data": "1. Passengers traveling as tourists are not allowed to enter. \n2. Passengers traveling on business or duty must spend 14 days in quarantine upon arrival."}, {"location": "Lebanon", "data": "Flights to Lebanon are suspended until 26 April 2020.\n- This does not apply to search and rescue, state aircraft and emergency medical flights.\n- This does not apply to diplomatic delegations working in Lebanon.\n- This does not apply to International Organizations personnel. \n- This does not apply to UNIFIL forces and personnel working for companies associated with drilling operations in Block No. 4.\n- This does not apply to military."}, {"location": "Saint Lucia", "data": "All airports in St. Lucia are closed until 30 April 2020."}, {"location": "Cayman Islands", "data": "Flights to Owen Roberts International (GCM) airport are suspended.\n- This does not apply to Cayman Airways domestic flights.\n- This does not apply to emergency and Medevac flights. They must obtain a prior approval from the Civil Aviation in Cayman Isl."}, {"location": "Viet Nam", "data": "1. Passengers are not allowed to enter Viet Nam.\n- This does not apply to passengers for diplomatic or official duty. They will be subject to mandatory medical declaration and self-isolation.\n- This does not apply to passengers who are experts, business managers or highly skilled workers. They will be subject to mandatory medical declaration and self-isolation.\n- This does not apply to passengers approved by National Steering Committee on Covid-19 Prevention and Control.\n- This does not apply to airline crew. They will be subject to mandatory medical declaration and other effective regulations as well as observing self-quarantine during their stay until the next flight schedule.\n2. For transportation of nationals of Vietnam returning to Vietnam, airlines must contact the Vietnamese Diplomatic Representative agency in the local country in advance. Noi Bai International Airport (HAN) is temporarily suspending all flights.\n3. All passengers will be placed on quarantine at a designated facility for 14 days upon arrival. \n4. All visa issuances are suspended.\n5. All passengers must fill out a quarantine form prior to arrival. \n6. Passengers who travel for diplomatic or official purpose will undergo a medical examination at the border before allowed to enter Viet Nam. \n7. Nationals of Italy and Korea (Rep.) with a normal passport are no longer visa exempt. \n8. Nationals of Denmark, Finland, France, Germany, Norway, Spain, Sweden and passengers with a British passport are no longer visa exempt.\n9. Passengers with a Certificate of Visa Exemption issued by Viet Nam are no longer visa exempt if they reside in China (People's Rep.), Denmark, Finland, France, Germany, Iran, Italy, Korea (Rep.), Norway, Spain, Sweden or United Kingdom. \n10. Nationals of Belarus, Japan and Russian Fed. with a normal passport are no longer visa exempt.\n11. Passengers with a Certificate of Visa Exemption issued by Viet Nam are no longer visa exempt if they are nationals of Belarus, Japan or Russian Fed. with a normal passport."}, {"location": "Latvia", "data": "Passengers are not allowed to transit or enter Latvia.\n- This does not apply to nationals and permanent residents of Latvia."}, {"location": "Estonia", "data": "Passengers are not allowed to enter Estonia.\n- This does not apply to nationals and residents of Estonia.\n- This does not apply to passengers who are entering Estonia in order to go back home with a transport other than the plane. They must not show any symptoms of Coronavirus (COVID-19).\n- This does not apply to nationals and residents of Latvia who work in Estonia. They must not show any symptoms of Coronavirus (COVID-19).\n- This does not apply to the following:\npassengers who are asymptomatic and who are directly involved in transporting goods and raw materials, including the loading of goods;\npersons related to the international transport of goods and passengers, members of the team or crew servicing the international means of transport, and the persons performing repair, warranty or maintenance operations on the means of transport;\npassengers related to the business continuity of critical services;\npassengers whose arrival in Estonia is related to the maintenance, repair or warranty activities of a device, or operations related to information and communication technology, if these are necessary for ensuring the operation of a company."}, {"location": "Myanmar", "data": "1. All visa issuances are suspended until 30 April 2020.\n2. All flights to Myanmar are suspended until 30 April 2020.\n- This does not apply to relief flights;\n- This does not apply to medical evacuation flights;\n- This does not apply to special flights approved by the Department of Civil Aviation."}, {"location": "Kiribati", "data": "1. Passengers who have been in Australia, China (People's Rep.), Egypt, France, Germany, Italy, Japan, Korea (Rep.), Malaysia, Singapore, Spain, Thailand, USA, United Arab Emirates, United Kingdom or Viet Nam are not allowed to enter Kiribati. They must have stayed in a country with no confirmed cases of Coronavirus (COVID-19) for a period of minimum 14 days before entering Kiribati. They must provide a medical clearance to confirm that they are free from the Coronavirus (COVID-19).\n\n2. Passengers must fill-in a \"Health Arrival Form\" and e-tickets must be provided to the immigration at time of arrival."}, {"location": "Italy", "data": "1. Passengers traveling as tourists are not allowed to enter via airports in the Lombardy region and the provinces of Alessandria, Asti, Modena, Novara, Padova, Parma, Pesaro and Urbino, Piacenza, Reggio Emilia, Rimini, Treviso-Venice, Verbano-Cusio-Ossola and Vercelli.\n2.Passengers traveling on business, for health reasons, in an emergency or if they are residents are allowed to enter Italy via airports in the Lombardy region and the provinces of Alessandria, Asti, Modena, Novara, Padova, Parma, Pesaro and Urbino, Piacenza, Reggio Emilia, Rimini, Treviso-Venice, Verbano-Cusio-Ossola and Vercelli.\n3.Passengers must inform their arrival to the regional Department of Prevention; and \n- are subject to health surveillance and isolation for 14 days; and \n- must submit a declaration that they entered Italy for proven working requirements for a maximum of 72 hours or for a justified extension for specific needs for additional 48 hours.\n4. A completed self-declaration form must be handed to the airline before arriving in Italy."}, {"location": "Madagascar", "data": "All flights to Madagascar are suspended until 20 April 2020."}, {"location": "Moldova", "data": "Passengers are not allowed to enter Moldova (Rep.).\n\n- This does not apply to nationals and residents of Moldova (Rep.)."}, {"location": "Marshall Islands", "data": "Passengers are not allowed to enter Marshall Isl. until 5 May 2020."}, {"location": "Macao", "data": "1. Visitors who reside or have been in the Hubei Province (Chine People's Rep.) in the past 14 days are not allowed to enter Macao (SAR China) unless they prove with a valid certificate that they are not infected with the Coronavirus (COVID-19).\n\n2. Passengers with a Macao (SAR China) passport and those residing in Macao (SAR China) who have been in the Hubei Province (Chine People's Rep.) in the past 14 days must fill-in a Health Declaration Form.\n3. Passengers who have been in Iran, Italy or Korea (Rep.) will be subject to quarantine for 14 days."}, {"location": "Macedonia", "data": "North Macedonia (Rep.) borders are closed.\n\n- This does not apply to nationals and residents of North Macedonia (Rep.).\n\n- This does not apply to accredited diplomats.\n\n- This does not apply to passengers with a special permit issued by the Ministry of Interior of North Macedonia (Rep.)."}, {"location": "Montenegro", "data": "Passengers arriving from Hubei Province of China (People's Rep.), Iran, Italy, Korea (Rep.) or Spain are not allowed to enter. \n- This does not apply to nationals of Montenegro."}, {"location": "Nauru", "data": "Passengers who have transited through or have been in China (People's Rep.), Hong Kong (SAR China), Italy, Korea (Rep.) or Macao (SAR China) in the past 21 days will not be allowed to enter Nauru."}, {"location": "Papua New Guinea", "data": "Passengers who have been in China (People's Rep.), Iran, Italy, Japan or Korea (Rep.) in the past 14 days are not allowed to enter Papua New Guinea. They must have spent 14 consecutive days in a country that is free from Coronavirus (COVID-19)."}, {"location": "Canada", "data": "1. Passengers who have been outside of Canada or USA in the past 14 days, are not allowed to enter Canada.\n- This does not apply to nationals of Canada.\n- This does not apply to immediate family members of nationals of Canada, which include:\na. the spouse or common-law partner of the person;\nb. a dependent child of the person or of the person's spouse or common-law partner;\nc. a dependent child of a dependent child referred to in paragraph b;\nd. the parent or step-parent of the person or of the person's spouse or common-law partner; or\ne. the guardian or tutor of the person. (membre de la famille immediate). \n- This does not apply to permanent residents of Canada and their immediate family members.\n- This does not apply to diplomats.\n- This does not apply to airline crew.\n- This does not apply to seasonal agricultural workers, fish/seafood workers, caregivers and all other temporary foreign workers.\n- This does not apply to international students who held a valid study permit, or had been approved for a study permit, when the travel restrictions took effect on March 18, 2020.\n- This does not apply to permanent resident applicants who had been approved for permanent residence before the travel restrictions were announced on March 18, 2020, but who had not yet travelled to Canada.\n- This does not apply to the following passengers:\na. Person registered as an Indian under the Indian Act;\nb. Person authorized in writing by a consular officer of the government of Canada to come to Canada to reunite with immediate family members;\nc. Person who is exempt from the requirements to obtain a temporary resident visa under paragraph 190 (2)(a) of the Immigration and Refugee Protection Regulations, and their immediate family members;\nd. Person who enters Canada at the invitation of the Minister of Health for the purpose of assisting in the COVID-19 response;\ne. Person who arrives by means of an aircraft operated by Canadian Forces or the Department of National Defence;\nf. Member of the Canadian Forces or a visiting force, as defined in section 2 of the Visiting Forces Act, and their immediate family members;\ng. Protected person, under section 95 (2) of the Immigration and Refugee Protection Act;\nh. French citizen who resides in Saint-Pierre-et-Miquelon who has not been outside Saint-Pierre-et-Miquelon / Canada / U.S. in the last 14 days;\ni. Person or class of persons that the Chief Public Health Officer, appointed under subsection 6 (1) of the Public Health Agency of Canada Act, determines does not pose a risk of significant harm to public health or who will provide an essential service while in Canada;\nj. Person whom the Minister of Foreign Affairs, the Minister of Citizenship and Immigration or the Minister of Public Safety and Emergency Preparedness determines their presence is in the national interest.\n2. Passengers with Coronavirus (COVID-19) symptoms are not allowed to travel to Canada until:\n- they have waited for a period of 14 days; or\n- they can present a medical certificate that confirms the patient is free from the Coronavirus (COVID-19). \n3. Passengers who have been refused boarding in the past 14 days due to a medical reason related to Coronavirus (COVID-19) are not allowed to enter.\n4. Passengers are required to self-isolate for a period of 14 days upon arrival at their final destination in Canada. \n5. Passengers who were in the cruise ship 'Diamond Princess' are subject to a mandatory 14-day isolation at a quarantine facility upon arrival in Canada. "}, {"location": "Niue", "data": "Passengers who have been in Australia, Austria, Belgium, Bulgaria, China (People's Rep.), Chinese Taipei, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hong Kong (SAR China), Hungary, Iceland, Ireland (Rep.), Indonesia, Iran, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Macao (SAR China), Netherlands, Norway, Poland, Portugal, Romania, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, USA or United Kingdom in the past 14 days are not allowed to enter Niue.\n- This does not apply to nationals and resident of Niue and to airline crew."}, {"location": "Oman", "data": "Passengers are not allowed to enter Oman. \n- This does not apply to nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates. \n- This does not apply to passengers with a resident visa issued by Oman. \nNationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, United Arab Emirates and passengers with a resident visa issued by Oman will be placed in quarantine for a minimum of 14 days."}, {"location": "Panama", "data": "1. Passengers are not allowed to enter Panama.\n- This does not apply to nationals of Panama.\n- This does not apply to passengers who reside in Panama.\n2. Nationals and residents of Panama must be in home quarantine for 14 days."}, {"location": "Namibia", "data": "Namibia's borders are closed until 23 April 2020."}, {"location": "New Caledonia", "data": "Flights to New Caledonia are suspended until 31 May 2020."}, {"location": "Nepal", "data": "All international flights to Nepal are suspended until 30 April 2020."}, {"location": "Peru", "data": "1. Passengers are not allowed to enter Peru until 26 April 2020.\n2. Airline crew must self-isolate at hotel Costa del Sol at Jorge Chavez International Airport for the entire duration of stay."}, {"location": "Polynesia", "data": "Passengers are not allowed to enter French Polynesia. \n- This does not apply to passengers who reside in French Polynesia"}, {"location": "Denmark", "data": "All passengers are not allowed to enter Denmark.\n\n- This does not apply to nationals of Denmark.\n\n- This does not apply to residents of Denmark.\n\n- This does not apply to passengers with one of the following purposes:\n\na. Visiting a critically or terminal ill family member;\n\nb. Participating in a funeral;\n\nc. Called for a court case;\n\nd. Exercising visitation rights with a minor;\n\ne. Being a legal guardian for a minor;\n\nf. Already in an ongoing health treatment;\n\ng. Have employment in Denmark – documentation needed;\n\nh. Passengers in transit or with connecting flights, and who can provide/present valid ticket for next destination which must be non-domestic;\n\ni. Passengers who can provide documentation for having their vehicle parked at Copenhagen Airport, and who need the vehicle for their ongoing journey out of Denmark (e.g. to Sweden)."}, {"location": "Palau", "data": "Passengers who have transited through or have been in China (People's Rep.), Hong Kong (SAR China) or Macao (SAR China) in the past 14 days are not allowed to enter Palau."}, {"location": "Paraguay", "data": "Flights to Paraguay are suspended until 26 April 2020.\n- This does not apply to health services and repatriation flights."}, {"location": "Qatar", "data": "1. Passengers are not allowed to enter Qatar.\n- This does not apply to nationals of Qatar.\n2. Nationals of Qatar are not allowed to exit Qatar."}, {"location": "Saudi Arabia", "data": "Passengers are not allowed to enter Saudi Arabia.\n\n-This does not apply to nationals of Saudi Arabia."}, {"location": "Thailand", "data": "Flights to Thailand are suspended until 30 April 2020 17:00 UTC.\n- This does not apply to state or military aircraft, emergency landing, technical landing without disembarkation, humanitarian aid, medical, relief and repatriation flights."}, {"location": "Malaysia", "data": "1. Passengers are not allowed to enter Malaysia.\n- This does not apply to nationals of Malaysia.\n- This does not apply to permanent residents of Malaysia.\n- This does not apply to passengers with a diplomatic passport.\n- This does not apply to passengers with official passport on a diplomatic mission.\n- This does not apply to passengers who are embassy employees with a proof of employment and their dependents.\n2. Nationals and residents of Malaysia will be quarantined for 14 days.\n3. Passengers who are embassy employees or have a diplomatic or official passport will be quarantined for 14 days.\nEffective 3 April 2020:\nTransfer from an international flight to a domestic flight is not allowed."}, {"location": "Pakistan", "data": "All international flights to Pakistan are suspended until 11 April 2020.\n- This does not apply to diplomatic, special and flights of national carriers. They must have a special approval from the competent authority for transporting stranded passengers. Passengers will be subject to thorough checking as per established procedures (including swab testing, isolation or quarantine). "}, {"location": "Puerto Rico", "data": "1. Passengers will be quarantined for 14 days.\n2. Passengers must present a completed Puerto Rico Department of Health form upon arrival."}, {"location": "Portugal", "data": "Flights to Portugal are suspended until 17 April 2020.\n-This does not apply to flights arriving from Angola, Austria, Belgium, Brazil (Sao Paulo (GRU) and Rio De Janeiro (RIO) airports only), Bulgaria, Canada, Cape Verde, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Guinea-Bissau, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Mozambique, Netherlands, Norway, Poland, Portugal, Romania, Sao Tome and Principe, Slovakia, Slovenia, South Africa, Spain, Sweden, Switzerland, USA, United Kingdom or Venezuela.\n- This does not apply to flights bringing back nationals and residence of Portugal."}, {"location": "Tajikistan", "data": "Passengers who have transited through or have been in Afghanistan, China (People’s Rep.), Iran, Italy or Korea (Rep.) in the past 14 days are not allowed to transit or enter Tajikistan.\n\n- This does not apply to nationals of Tajikistan."}, {"location": "Slovakia", "data": "Passengers are not allowed to enter Slovakia.\n-This does not apply to nationals and residents of Slovakia. They must remain in quarantine for 14 days upon arrival."}, {"location": "Greece", "data": "1. Passengers are not allowed to enter Greece until 15 May 2020.\n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland.\n- This does not apply to family members of nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland.\n- This does not apply to passengers with a British passport and their family members.\n- This does not apply to passengers with a residence permit issued by Greece. A certificate of application for renewal of a residence permit issued by Greece is not accepted.\n- This does not apply to passengers with a residence permit issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.\n- This does not apply to passengers with a long term visa issued by Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom.\n- This does not apply to:\na. healthcare professionals and health researchers designated to support the national health care system;\nb. government members, diplomats, staff of international organizations, military personnel and humanitarian aid workers in the exercise of their duties;\nc. passengers in transit;\nd. airline crew;\ne. passengers travelling for imperative family or business reasons provided that the relevant authorization has been obtained by the Greek embassy/consulate.\n2. Passengers arriving in Greece must go under quarantine for 14 days upon arrival. They must give their contact information to the authorities at the airport of arrival.\n- This does not apply to airline crew.\n- This does not apply to state flights, sanitary flights, humanitarian flights and military flights. \n3. Flights from and to Turkey are suspended until 15 May 2020.\n- This does not apply to the following flights:\na. flights approved by the Hellenic Ministry of Foreign Affairs for repatriation of Greek citizens, their family members and holders of residence permit in Greece.\nb. state flights.\nc. sanitary flights.\nd. humanitarian flights.\ne. emergency flights.\nf. fire fighting flights.\ng. frontex flights.\nh. technical landings where passengers do not disembark. \n4. Flights from and to Germany, Italy, Netherlands, Spain and the United Kingdom are suspended until 15 May 2020.\n- This does not apply to the following flights:\na. flights designated to support the Hellenic national healthcare system.\nb. flights approved by the Hellenic ministry of Foreign Affairs for repatriation of Greek citizens, their family members and holders of residence permit in Greece.\nc. state flights.\nd. sanitary flights.\ne. humanitarian flights.\nf. emergency flights.\ng. military flights.\nh. fire fighting flights.\ni. frontex flights.\nj. technical landings where passengers do not disembark."}, {"location": "El Salvador", "data": "El Salvador International Airport San Oscar Arnulfo Romero y Galdamez is closed until 28 April 2020.\n- This does not apply to US military flights (CSL), humanitarian aid flights, ambulance flights, ferry/maintenance flights, repatriation flights with a special clearance. "}, {"location": "Belgium", "data": "1. Passengers are not allowed to enter until 15 May 2020. \nThis does not apply to:\n- Passengers arriving from an EEA Member States, Switzerland or the United Kingdom.\n- Nationals of EEA Member States and Switzerland returning home.\n- British nationals returning home.\n- Nationals of Andorra, Monaco, Montenegro, North Macedonia (Rep.), San Marino, Serbia and Vatican City (Holy See) with proof of connection travel to their home country.\n- Passengers with a long term residence permit or a long term visa issued by EEA Member States, Switzerland or the United Kingdom.\n- Family members of nationals of EEA Member States, Switzerland, and of British nationals;\n- Diplomats;\n- Personnel of international and humanitarian organizations;\n- Humanitarian aid workers;\n- Military personnel.\n2. Passenger flights are only allowed to operate between 7:00 and 21:00.\n- This does not apply to humanitarian, repatriation and United Nations flights.\n3. Belgium temporarily reintroduced border controls."}, {"location": "Lithuania", "data": "1. Passengers are not allowed to enter Lithuania.\n-This does not apply to:\n- nationals and residents of Lithuania\n- diplomats accredited to Lithuania\n- NATO personnel and personnel working for them and their family members\n- passengers with permission by issued by the respective minister and by the government.\n2.Passengers allowed to enter must arrive at Vilnius (VNO), Kaunas (KUN), Palanga (PLQ) or Siauliai (SQQ)\n3.Transit through Lithuania is possible only for passengers traveling in groups on their way back to their country of residence. They must be escorted to the international border crossing points.\n4.Flights with a permission issued by the Lithuanian Transport Safety Administration under the order of the Minister of Transport and Communications can operate to Lithuania.\n5.Returning nationals and residents of Lithuania are subject to 14 days isolation.\n6.Airline crew must be in isolation until the day of departure, but no longer than 14 days."}, {"location": "Sudan", "data": "All airports in Sudan are closed until 23 April 2020.\n- This does not apply to humanitarian aid, medical and relief flights."}, {"location": "Singapore", "data": "1. Passengers traveling as short-term visitors are not allowed to transit or enter Singapore. \n-This does not apply to returning residents of Singapore (Singapore Citizens, Permanent Residents or Long-Term Pass Holders(including holders of Work Pass, Student's Pass, Dependant's Pass, and Long-Term Visit Pass)). If they have been in Hubei Province (China People's Rep.) within the last 14 days, they will be quarantined for 14 days upon entry into Singapore. For others, they will be issued a 14-day Stay-Home-Notice (SHN) upon entry into Singapore.\n- This does not apply to passengers with a letter titled \"WAIVER OF RESTRICTION ON SHORT-TERM VISITORS FROM ENTRY INTO SINGAPORE BASED ON MEDICAL GROUNDS\" issued by the Singapore Ministry of Health. The waiver must be valid for 14 days from the date of approval and is valid for one time use only. Those passengers are still subject to the Immigration and Checkpoints Authority (ICA) 's prevailing entry requirements and screening at the checkpoints.\n2. Long-Term Visit Pass (issued by Immigration and Checkpoints Authority) holders and Long-Term Visit Pass In-Principle Approval (issued by Immigration and Checkpoints Authority) holders, will only be allowed entry if they have an Approval Letter of Entry (ALE) from Immigration and Checkpoints Authority (ICA). \n3. All Student's Pass holders and Student's Pass In-Principle Approval holders, will only be allowed entry if they have an Approved Letter for Entry (ALE) from the Ministry of Education (MOE). \n4. New and existing work pass holders are only allowed to enter Singapore with the Ministry of Manpower's (MOM) prior approval. They are required to show the MOM's approval letter to airline staff upon check-in and before boarding, as well as to the Immigration & Checkpoint Authority (ICA) officers at the immigration checkpoint upon their arrival in Singapore. \n5. Short-term visitors with an Approval Letter of Entry (ALE) from either Immigration and Checkpoints Authority (ICA), or the Ministry of Health (MOH), will not be subjected to the above restrictions. However, they may still be subjected to the prevailing health screening requirements upon arriving at a Singapore airport. Possession of an Approval Letter of Entry (ALE) does not guarantee the issuance of a Visit Pass to enter Singapore. \n6. All travellers entering Singapore, including Singapore Citizens, Permanent Residents and Long-Term Pass (LTP) holders, must submit a health declaration before proceeding with immigration clearance. They will have to do so via the SG Arrival Card (SGAC) e-Service, at https://eservices.ica.gov.sg/sgarrivalcard or the mobile application that can be downloaded for free from Apple AppStore and Google Play. \n7. Airlines are requested to inform passengers at the various touchpoints (e.g. at check-in and before boarding at point of departure, in-flight) to submit their health declaration via the SGAC e-Service prior to their arrival in Singapore.\n8. The paper-based embarkation/disembarkation card will be discontinued. As such, all airlines operating into Singapore can stop distributing these cards for all flights with scheduled time of arrival (STA) into Singapore on or after 27 March 2020, 0900 hours.\n9. All returning residents, with travel history to Brunei Darussalam, Cambodia, France, India, Indonesia, Lao People's Dem. Rep., Malaysia, Myanmar, Philippines, Switzerland, Thailand, USA, United Kingdom or Viet Nam in the last 14 days, are required to serve out their mandatory 14-day Stay-Home Notice (SHN) at dedicated hotels.\n10. Flight and cabin crew of foreign airlines, who are Singapore Citizens, Permanent Residents or long-term pass holders entering Singapore, will be issued with a Stay-Home Notice (SHN). Such crew with travel history to Brunei Darussalam, Cambodia, France, India, Indonesia, Lao People's Dem. Rep., Malaysia, Myanmar, Philippines, Switzerland, Thailand, USA, United Kingdom or Viet Nam within the last 14 days must serve the SHN at Crowne Plaza Changi Airport. Those who do not have travel history to the listed countries within the last 14 days may serve the SHN at their residence in Singapore. The SHN must be served until their next departure flight out of Singapore or for 14 days, whichever is earlier.\n11. Flight and cabin crew of foreign airlines, who are not Singapore Citizens, Permanent Residents or long-term pass holders, will not be allowed to enter Singapore, or transit through Singapore. This does not apply to flights that require a layover due to flight time limitations or an aircraft-on-ground (AOG) situation in Singapore. In this case, airlines may layover their flight and cabin crew at Crowne Plaza Changi Airport. They will be issued with an SHN which shall be served until their next departure flight out of Singapore."}, {"location": "Sierra Leone", "data": "Passengers who have transited through or have been in China (People's Rep.) in the past 14 days, will be subject to immediate quarantine."}, {"location": "Sint Maarten", "data": "1. Passengers are not allowed to enter St. Maarten. \n-This does not apply to residents of St. Maarten or Saint Martin (FWI). They must hold a proof of residence, which can be a St. Maarten/ Saint Martin driving license or a St. Maarten ID/ Saint Martin carte d'identite or a St. Maarten/Saint Martin registration document.\n-This does not apply to airline crew. \n-This does not apply to passengers who are specialists with evidence of traveling at the invitation of the Government of St. Maarten. \n2. Residents of St. Maarten must self-quarantine for 14 days. \n3. Airline crew that are overnighting must undergo a mandatory self-quarantine."}, {"location": "Saint Helena, Ascension and Tristan da Cunha", "data": "1. Passengers are not allowed to enter St. Helena.\n- This does not apply to passengers who reside in St. Helena.\n- This does not apply to passengers with a long-term permit.\n- This does not apply to temporary contractors.\n- This does not apply to sponsor Technical Cooperation Officers.\n- This does not apply to passengers to Ascension.\n- This does not apply to persons authorized in advance by the Governor.\n2. Self-isolation for 14 days is mandatory when entering St. Helena."}, {"location": "Senegal", "data": "Flights to Senegal are suspended until 31 May 2020."}, {"location": "Somalia", "data": "1. Passengers who have been in China (People's Rep.) in the past 14 days are not allowed to enter Somalia.\n\n2. Residents of Somalia who have been in China (People's Rep) are subject to immediate quarantine for a maximum of 14 days."}, {"location": "Trinidad and Tobago", "data": "Airports in Trinidad and Tobago are closed until 30 April 2020.\n- This does not apply if permitted by the Minister with responsibility for national security."}, {"location": "Tuvalu", "data": "Tuvalu's borders are closed."}, {"location": "Taiwan", "data": "1. Passengers are not allowed to transit Chinese Taipei until 30 April 2020. \n2. Passengers are not allowed to enter Chinese Taipei.\n- This does not apply to passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport.\n- This does not apply to passengers with an Alien Resident Certificate.\n- This does not apply to personnel on diplomatic or official business.\n- This does not apply to passengers who can prove they are fulfilling commercial and contractual obligations, or passengers requiring special permission. \n- This does not apply to passengers with a visa with \"SPECIAL ENTRY PERMIT FOR COVID-19 OUTBREAK\" stated on remarks. \n3. Passengers allowed to enter must observe a 14-day home quarantine upon arrival."}, {"location": "Tanzania, United Republic of", "data": "1. All passengers and airline crew must undergo quarantine for 14 days at their own expense.\n\n2. A completed \"Health Form\" must be presented to the Ministry of Health personnel upon arrival."}, {"location": "Ukraine", "data": "Flights to Ukraine are suspended until 24 April 2020."}, {"location": "Uganda", "data": "All international flights to Uganda are suspended until 24 April 2020.\n- This does not apply to:\n1. Aircraft in a state of emergency.\n2. Operations related to humanitarian aid, medical and relief flights.\n3. Technical landings where passengers do not disembark.\n4. Any other flight that may be so approved by the appropriate authority."}, {"location": "Uruguay", "data": "1. Passengers are not allowed to enter Uruguay. \n- This does not apply to nationals and residents of Uruguay.\n- This does not apply to accredited diplomats. \n2. Passengers are not allowed to transit through Uruguay.\n- This does not apply to nationals and residents of Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay and Venezuela transiting through Montevideo (MVD) or Punta del Este (PDP).\n3. Nationals and residents of Uruguay, airline crew and accredited diplomats will be placed in quarantine for 14 days. \n4. Passengers can only land at Montevideo (MVD) and Punta del Este (PDP).\n5. Flights from Europe to Uruguay are suspended until 19 April 2020."}, {"location": "Uzbekistan", "data": "Flights to Uzbekistan are suspended."}, {"location": "Saint Vincent and the Grenadines", "data": "Passengers who have been in China (People's Rep.), Hong Kong (SAR China), Japan, Korea (Rep.), Macao (SAR China) or Singapore in the past 14 days will not be allowed to enter St. Vincent and the Grenadines."}, {"location": "Virgin Islands, British", "data": "All airports are closed until 1 June 2020. International crew members on incoming vessels will be required to remain within the port facility and comply with public health measures in effect."}, {"location": "Virgin Islands, U.S.", "data": "Passengers are not allowed to enter Virgin Isl. (USA) until 24 April 2020."}, {"location": "United Arab Emirates", "data": "1. Flights to United Arab Emirates are suspended from 24 March 2020 23:59 Local Time until further notice.\n- This does not apply to the following:\na) aircraft operated for the purpose of evacuation (this Safety Decision does not alleviate the need for obtaining necessary authorisation from UAE Ministry of Foreign Affairs and International Cooperation);\nb) UAE registered aircraft that are out of base on 24 March 2020 23:59 Local Time will be allowed to return to base carrying only UAE nationals and operator's crewmembers;\nc) domestic flights;\nd) over-flights. \n2. ALL Evacuation flights must have PAX APP data and Crew APP data; ALL ferry flights must have crew APP data."}, {"location": "Vanuatu", "data": "Vanuatu ports of entry are closed."}, {"location": "Bangladesh", "data": "1. The visa on arrival facility has been suspended for all nationalities.\n2. All international flights arriving from Bahrain, Bhutan, Hong Kong (SAR China), India, Kuwait, Malaysia, Maldives, Oman, Qatar, Saudi Arabia, Sri Lanka, Singapore, Thailand, Turkey, United Arab Emirates or United Kingdom are suspended until 30 April 2020.\n3. Passengers who have been Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland since the 1 March 2020 are not allowed to enter Bangladesh until 30 April 2020.\n- This does not apply to passengers traveling on diplomatic missions and their family members. \n4. Nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland who reside outside the EU region or Iran since 29 February 2020 can travel to Bangladesh. They must have a visa.\n5. Passengers who have a valid visa must show a medical certificate (with English translation) obtained within 72 hours of travel. The medical certificate must be submitted upon arrival and must indicate that the passenger does not have any symptoms of COVID-19.\n6. Passengers with Bangladesh origin who do not submit a medical certificate stating that the passenger does not have any symptoms of COVID-19, will be institutionally quarantined in Dhaka for 14 days.\n7. Passengers with Bangladesh origin who submits a medical certificate stating that the passenger does not have any symptoms of COVID-19, will be home quarantined in Dhaka for 14 days. If the medical certificate shows that the passenger has symptoms of COVID-19, they will be institutionally quarantined in Dhaka for 14 days."}, {"location": "Kuwait", "data": "Flights to Kuwait are suspended.\n- This does not apply to cargo, diplomatic, humanitarian or repatriation flights approved by the DGCA Air Transport Department.\n- This does not apply to aircraft operated by Kuwait Air Force, Kuwait Police Wing and Kuwait Ameri Flight.\n- This does not apply to aircraft exempted by the authority.\n1. Passengers arriving from China (People's Rep.), Egypt, France, Germany, Hong Kong (SAR China), Iran, Iraq, Italy, Korea (Rep.), Spain, USA or United Kingdom are required to undergo 14 days compulsory quarantine. \n2. Passengers arriving from a country other than China (People's Rep.), Egypt, France, Germany, Hong Kong (SAR China), Iran, Iraq, Italy, Korea (Rep.), Spain, USA or United Kingdom required to self-quarantine for 14 days."}, {"location": "Zambia", "data": "1. All flights must arrive at Kenneth Kaunda International Lusaka Airport (LUN).\n2. Passengers and airline crew must quarantine for at least 14 days at their own costs."}, {"location": "Austria", "data": "1. Passengers arriving from a non-Schengen Member State are not allowed to enter Austria. \n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland. \n- This does not apply to passengers with a British passport. \n- This does not apply to residents of Austria. \n- This does not apply to passengers with a D visa issued by Austria. \n- This does not apply to passengers with a medical certificate dated from a maximum of 4 days before their arrival in Austria. The medical certificate must confirm that the person is not affected by Coronavirus (COVID-19), and be in German or in English. \n- This does not apply to:\na. passengers traveling on diplomatic missions and their family members if living in the same household, and\nb. employees of international organisations and their family members if living in the same household, and\nc. humanitarian workers, and \nd. healthcare professionals, and\ne. transport personnel including crew engaged in transport of goods, and\nf. crew members of emergency, rescue/ambulance or ferry flights. \n2. Nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland must self-quarantine for 14 days and this must be confirmed by signature. This does not apply if their immediate departure is ensured. \n3. Passengers with a British passport must self-quarantine for 14 days and this must be confirmed by signature. This does not apply if their immediate departure is ensured.\n4. Residents of Austria and passengers with a D visa issued by Austria must self-quarantine for 14 days and this must be confirmed by signature. This does not apply if their immediate departure is ensured."}, {"location": "Bosnia and Herzegovina", "data": "Passengers are not allowed to enter Bosnia and Herzegovina.\n- This does not apply to nationals and residents of Bosnia and Herzegovina.\n- This does not apply to diplomatic and consular staff accredited in Bosnia and Herzegovina.\n- This does not apply to civil servants coming for employment.\n- This does not apply to passengers in need of emergency medical treatment.\n- This does not apply to cross-border workers.\n- This does not apply to civilian protection services and teams.\n- This does not apply to military forces of the NATO and other states participating in the partnership for Peace; and to NATO and EUFOR headquarters in Bosnia and Herzegovina.\n- This does not apply to heads of state and members of their delegations whose arrival and departure has been announced by the competent authority.\n- This does not apply to passengers in transit to return to the country of residence.\n- This does not apply to passengers with a special permit to stay or transit in Bosnia and Herzegovina."}, {"location": "Kosovo", "data": "1. Passengers are not allowed to enter Kosovo (Rep.).\n- This does not apply to nationals of Kosovo (Rep.), \n- This does not apply to diplomats accredited to Kosovo (Rep.). \n- This does not apply to representatives of the NATO-Kosovo Force (KFOR) and the European Union Rule of Law Mission in Kosovo (EULEX). \n2. Passengers allowed to enter Kosovo (Rep.) are subject to mandatory quarantine for 14 days."}, {"location": "South Africa", "data": "Flights to South Africa are suspended until further notice.\n- This does not apply to:\na. Nationals of South Africa who will be subject to quarantine for up to 21 days;\nb. Airline crew who will be subject to quarantine laws as applicable;\nc. Flights authorized by the Ministry of Transport;\nd. Medical evacuation;\ne. Aircraft in state of emergency;\nf. Overflight aircraft which need to refuel;\ng. Aircraft operations related to humanitarian aid, relief flights and other safety-related operations."}, {"location": "Bahrain", "data": "1. Passengers and airline crew who have been in Austria, Belgium, China (People's Rep.), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Iraq, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom and USA in the past 14 days are not allowed to transit and enter Bahrain. \n\n- This does not apply to nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and United Arab Emirates.\n\n- This does not apply to passengers who reside in Bahrain.\n\n- This does not apply to military personnel.\n\n- This does not apply to passengers with a special approval from Nationality, Passport Residence Affairs Directorate of Bahrain.\n\n- This does not apply to passengers with a valid letter of Prior Permission Granted which is presented prior to boarding.\n\n2. Passengers and airline crew who have been in Hong Kong (SAR China), Italy, Japan, Lebanon, Malaysia, Singapore or Thailand in the past 14 days must have a valid visa prior to arrival.\n\n- This does not apply to nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and United Arab Emirates.\n\n- This does not apply to passengers who reside in Bahrain.\n\n- This does not apply to passengers with a valid letter of Prior Permission Granted which is presented prior to boarding.\n\n3. Nationals of Bahrain, Kuwait, Oman, Qatar, Saudi Arabia, United Arab Emirates who have transited through or have been in Austria, Belgium, China (People's Rep.), Hong Kong (SAR China), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Iraq, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Malaysia, Netherlands, Norway, Poland, Portugal, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, United Kingdom or USA will be subject to quarantine and enhanced testing procedures recommended by the World Health Organization (WHO). \n\n4. Passengers who reside in Bahrain and who have transited through or have been in China (People's Rep.), Egypt, Hong Kong (SAR China), Iran, Iraq, Italy, Japan, Korea (Rep.), Lebanon, Malaysia, Singapore or Thailand will be subject to quarantine and enhanced testing procedures recommended by the World Health Organization (WHO).\n5. Border crossing on the causeway has been temporarily suspended due to Coronavirus (COVID-19)."}, {"location": "Maldives", "data": "11. Velana Airport (MLE) is closed every day from 16:00 to 01:00.\n2. All visas on arrival are suspended.\n- This does not apply to passengers with a special permission granted by the Maldives government. \n3. Passengers traveling as tourists and airline crew who have been in Bangladesh, China (People's Rep.), Iran, Italy, Malaysia, Spain, Sri Lanka, United Kingdom or in North Gyeongsang and South Gyeongsang Provinces in Korea (Rep.), Ile-de-France and Grand Est (regions of France) and Bavaria, North Rhine Westphalia and Baden-Wuerttemberg (regions of Germany) in the past 14 days are not allowed to enter the Maldives. \n- This does not apply to nationals of Maldives and their spouses. \n4. Nationals and residents of Maldives will be subject to 14-day quarantine upon arrival. Carriers intending to carry nationals of Maldives on inbound flights shall seek prior approval from relevant authorities.\n5. All passengers traveling to the Maldives for a purpose other than tourism will be quarantined for 14 days at a place designated by the Government.\n6. A completed \"Health Declaration Card\" and an \"Immigration Arrival Card\" must be presented upon arrival."}, {"location": "Tunisia", "data": "All flights to Tunisia are suspended.\n- This does not apply to repatriation flights with a prior approval."}, {"location": "Bonaire, Sint Eustatius and Saba", "data": "Passengers arriving from Austria, Belgium, Bulgaria, Canada, China (People's Rep.), Colombia, Croatia, Cyprus, Czechia, Denmark, Dominican Rep., Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland, United Kingdom or USA are not allowed to enter Bonaire, St. Eustatius and Saba. \n- This does not apply to medical staff and patients who are transferred in the interest of public health on Bonaire, St. Eustatius and Saba."}, {"location": "Finland", "data": "1. Passengers are not allowed to enter Finland.\n- This does not apply to nationals of Finland. \n- This does not apply to family members of nationals of Finland. \n- This does not apply to passengers with a residence permit issued by Finland. \n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland residing in Finland, and their family members. \nThis does not apply to passengers with a British passport residing in Finland, and their family members. \n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden or Switzerland and their family members who are returning via Finland to their respective country of residence. \n- This does not apply to passengers with a British passport and their family members who are returning via Finland to their respective country of residence. \nThis does not apply to residents of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden, Switzerland or United Kingdom who are returning via Finland to their respective country of residence. \n- This does not apply to the following passengers:\na. Healthcare and rescue service professionals/personnel, health researchers, and elderly care professionals;\nb. Transport personnel and other transport staff to the extent necessary;\nc. Workers, who based on permanent employee relationship work daily in another country and returns back to the country of residence at least once a week, taking into consideration local circumstances and natural travel-to-work area;\nd. Diplomats, staff of international organisations, military personnel and humanitarian aid workers in the exercise of their functions;\ne. Necessary (return) transit and returns;\nf. Passengers travelling for imperative family reasons;\ng. Persons in need of international protection or for other humanitarian reasons;\nh. Other necessary and justified traffic. For example, other necessary traffic would be maintenance work, that requires maintenance team or a person arriving from another country and this work cannot be postponed. \n2. Nationals and residents of Finland will be required to self-quarantine for 14 days."}, {"location": "Poland", "data": "Passengers are not allowed to enter Poland until 25 April 2020.\nEntry into Poland is still allowed for:\n1. Nationals of Poland, their spouses and children.\n2. Passengers who are under permanent custody of nationals of Poland.\n3. Passengers with a temporary or permanent residence permit.\n4. Passengers who have the right to work in the territory of Poland, i.e. foreigners entitled to work under the same conditions as Polish citizens, possessing a work permit, seasonal work permit, a declaration of entrusting work to a foreigner on the territory of Poland,\n5. Passengers with a Pole's Card.\n6. Heads of diplomatic missions and members of the diplomatic and consular personnel of a mission (with a diplomatic rank).\n7. In particularly justified cases, not included above, the commander of the Border Guard post, after obtaining the consent of the Chief of the Border Guard, may allow a foreigner to enter the territory of Poland in accordance with the procedure specified in the Act of 12 December 2013 on foreigners (Journal of Laws of 2020 item 35).\n\nFlights to Poland are suspended until 25 April 2020. \n-This does not apply to flights with status HOSP, HUM, HEAD and other flights performed to save people's lives or health, flights to protect public order, emergency flights, flights at the order of the Prime Minister, flights performed by foreign air carriers at the order of foreign states to bring back their nationals."}, {"location": "China", "data": "1. The mainland of China has decided to temporarily suspend the entry into the mainland of China by foreign nationals holding visas or residence permits still valid to the time of this announcement, effective from 00:00 local time, 28 March 2020. Entry by foreign nationals with APEC Business Travel Cards will be suspended as well. \n- Policies including port visas, 24/72/144-hour visa-free transit policy, Hainan 30-day visa-free policy, 15-day visa-free policy specified for foreign cruise-group-tour through Shanghai Port, Guangdong 144-hour visa-free policy specified for foreign tour groups from Hong Kong or Macao SAR, and Guangxi 15-day visa-free policy specified for foreign tour groups of ASEAN countries will also be temporarily suspended. Entry with diplomatic, service, courtesy or C visas will not be affected. \n- Foreign nationals coming to the mainland of China for necessary economic, trade, scientific or technological activities or out of emergency humanitarian needs may apply for visas at Chinese embassies or consulates. \n- Entry by foreign nationals with visas issued after this announcement will not be affected.\n2. All passengers arriving at PEK will have a PCR test and be quarantined at the designated location in Beijing for 14 days. \n3. Passengers arriving at Shanghai Pudong (PVG) or Shanghai Hongqiao (SHA) must undergo a Nucleic Acid Test (NAT) and a 14-day quarantine in designated places for medical observation.\n- This does not apply to airline crew members. \n4. Airline crew members with a layover in Shanghai Pudong (PVG) or Shanghai Hongqiao (SHA) must undergo Nucleic Acid Test (NAT) inside passenger terminal. They are permitted to self-isolate at hotel temporarily before acquiring the NAT result.\nThe crew whose COVID-19 testing result is positive will be isolated by the authorities at the nominated site for further medical treatment. Meanwhile, the carrier will be notified immediately.\nIf the crew is already away from Shanghai when the positive test result is available, the carrier will be informed by the authorities to take further action if necessary. \n5. Airline crew arriving at Shanghai Pudong (PVG) or Shanghai Hongqiao (SHA) will be quarantined after they finish their last shift of flight. During their shift breaks, they are required to stay in crew hotels for isolation. \n6. Passengers who live in or have been in France, Germany, Iran, Italy, Japan, Korea (Rep.), Spain or USA in the past 14 days arriving at Guangzhou (CAN) or Shenzhen (SZX) must undergo 14-day quarantine at home or in designated places for medical observation. All passengers arriving at SZX will have a PCR test.\n7. All passengers arriving at XMN will be quarantined for medical observation at the designated hotels for 14 days on their own expenses.\n- This does not apply to passengers under 18 years old, passengers above 70 years old, pregnant women and passengers suffering from illness. They must apply for permission to undergo a 14-day quarantine at home."}, {"location": "Luxembourg", "data": "Passengers are not allowed to enter Luxembourg until the 17 April 2020.\n\n- This does not apply to nationals of Luxembourg and their family members in order to return home.\n\n- This does not apply to nationals of the European Union, Schengen Member States and the Schengen Associated States, passengers from the United Kingdom, and their family members in order to return home.\n\n- This does not apply to passengers who have a long-term resident status in accordance with the European Directive 2003/109 / EC relating to long-term residents, as well as any other person who have a right of residence in accordance with European directives as well as national law in Grand Duchy of Luxembourg or one of the neighboring countries.\n\n- This does not apply to healthcare professionals, health researchers and healthcare professionals to the elderly.\n\n- This does not apply to cross-border workers.\n\n- This does not apply to members of the diplomatic corps, personnel of international organizations, the military, personnel of the development cooperation and humanitarian aid, during the exercise of their respective functions.\n\n- This does not apply to passenger travelling by land to their country of origin. They must have a proof of onward journey.\n\n- This does not apply to passengers traveling for urgent and duly justified family reasons.\n\n- This does not apply to passengers who want to apply for international protection or subsidiary protection in the Grand Duchy of Luxembourg or for other humanitarian reasons."}, {"location": "Russian Federation", "data": "Passengers are not allowed to enter the Russian Fed. \n- This does not apply to nationals of the Russian Fed.; \n- This does not apply to accredited or appointed employees of diplomatic missions, consular offices, international organizations located in Russian Fed. and their family members;\n- This does not apply to airline crew;\n- This does not apply to members of official delegations;\n- This does not apply to travelers with diplomatic, business or normal visas issued in connection with the death of a close relative, as well as visas issued by special decision of the Russian Ministry of Foreign Affairs;\n- This does not apply to passengers from visa-free countries coming in connection with the death of a close relative, having copies of death certificate, as well as a document confirming family relations;\n- This does not apply to passengers who are family members (spouses, parents, kids, adoptive parents, adopted), guardians and trustees of citizens of the Russian Fed., subject to the presentation of a copy of a document confirming the relationship status;\n- This does not apply to passengers permanently residing in the Russian Fed., as well as transiting through airports without entering the Russian Fed."}, {"location": "Tonga", "data": "1. Passengers and airline crew arriving from or transiting through China (People's Rep.), Chinese Taipei, Hong Kong (SAR China) or Macao (SAR China) are not allowed to enter Tonga. This does not apply if they have stayed in a country with no confirmed cases of Coronavirus (COVID-19) for a period of minimum 14 days before entering Tonga. They must have an official medical clearance undertaken within 3 days prior to arrival in Tonga.\n\n- This does not apply to nationals of Tonga and their immediate family members.\n\n- This does not apply to permanent residents of Tonga and their immediate family members.\n\n- This does not apply to airline crew on direct flights from China (People's Rep.) who have been using appropriate personal protective equipment (PPE).\n\n2. Passengers must complete a 'Traveler's Arrival Health Declaration Card' and submit it to the Ministry of Health Border Control when arriving in Tonga."}, {"location": "Croatia", "data": "1. Passengers are prohibited from crossing the borders of Croatia until 18 April 2020.\n- This does not apply to nationals of Croatia and their family members and to those going to a country where they work and live.\n- This does not apply to nationals of the EU, Schengen Member States and the Schengen Associated States, passengers from the United Kingdom, and their family members, if they are returning via Croatia to their country of residence.\n- This does not apply to passengers with a long-term resident permit or a long-term visa issued by a Schengen Member State and the persons deriving their right to reside from other EU Directives or national law or who hold national long-term visas, if they are returning via Croatia to their country of residence.\n- This does not apply to healthcare professionals, healthcare researchers and collaborators, experts in care for the elderly, and persons requiring urgent medical treatment. \n- This does not apply to cross-border workers.\n- This does not apply to diplomats, police officers in the performance of their activities, Civil Defence services and teams, international organizations staff and International military personnel in carrying out their functions.\n- This does not apply to passengers in transit (including passengers in transit by air transport).\n2. All passports and national ID cards issued to nationals of Croatia and which have expired on 11 March 2020 or later, are considered valid. This is due to the COVID-19 Pandemic. "}, {"location": "Sri Lanka", "data": "1. All airports in Sri Lanka are closed.\n- This does not apply to:\na. Aircraft departures with passengers originating from Colombo, stop overs, transit passengers or visiting tourists;\nb. Emergency diversions;\nc. Humanitarian flights;\nd. Technical landing.\n2. A completed Health Declaration Form must be presented to the public health inspectors or any other authorized officials upon arrival. \n3. Airline crew must self-quarantine at the location mentioned in the Health Declaration Form and have meals only through in-room dining until they operate the next flight. They must follow strict procedures and hygienic measures adopted by the Government of Sri Lanka.\n4. Visas and ETAs issued by Sri Lanka have been invalidated."}, {"location": "Serbia", "data": "1. Passengers are not allowed to enter Serbia.\n- This does not apply to nationals of Serbia. \n- This does not apply to residents of Serbia.\n- This does not apply to accredited diplomats and passengers with a special permission issued by the Ministry of Health, the Ministry of Foreign Affairs, the Ministry of Interior or the Ministry of Construction, Transport and Infrastructure. \n2. Nationals and residents of Serbia arriving from any country are required to self-isolate for a period of 14 days. \n- This does not apply when arriving from Austria, France, Germany, Greece, Iran, Italy, Romania, Slovenia, Spain or Switzerland.\n3. Nationals and residents of Serbia arriving from Austria, France, Germany, Greece, Iran, Italy, Romania, Slovenia, Spain or Switzerland are required to self-isolate for a period of 28 days."}, {"location": "Hong Kong", "data": "1. Passengers are not allowed to transit or enter Hong Kong SAR, China.\n- This does not apply to passengers with a Hong Kong SAR, China passport.\n- This does not apply to passengers with a British passport with nationality \"British National (Overseas)\" with the right of abode in Hong Kong SAR, China.\n- This does not apply to residents of Hong Kong SAR, China with a Permanent Identity Card.\n- This does not apply to residents of Hong Kong SAR, China with a Identity card accompanied by a valid work or study visa.\n- This does not apply to passengers who have only been in the mainland of China, Chinese Taipei or Macao SAR, China in the past 14 days.\n- This does not apply to residents of Macao SAR, China who are registered the Macao SAR, China scheme that they will be immediately taken by coach back to Macao SAR, China upon entry.\n- This does not apply to the following passengers:\na. Passengers travelling from the mainland of China or Chinese Taipei or Macao SAR, China and have not been to any other country/region in the past 14 days;\nb. Crew members of aircraft who need to commute to and from foreign places for performance of necessary duties or crew members of goods vessels;\nc. Government officials carrying out government duties including personnel of consular posts;\nd. Spouses and minor children of Hong Kong SAR, China residents;\ne. Personnel engaged in anti-epidemic work endorsed by the HKSAR Government.\n2. All passengers who are eligible to enter Hong Kong SAR, China will be required to undergo 14 days compulsory quarantine.\n3. All arriving passengers and crew members must present a completed Health Declaration Form to the Department of Health upon arrival."}, {"location": "New Zealand", "data": "1. New Zealand borders are closed.\n- This does not apply to nationals of New Zealand, permanent residents and residents with valid travel conditions, and their immediate family.\n- This does not apply to nationals Australia and permanent residents if New Zealand is their primary place of established residence.\n- This does not apply to diplomats accredited to New Zealand and currently resident in New Zealand.\n- This does not apply to Visitor, student and work visa holders who are ordinarily resident in New Zealand and who are the partner or dependent child of a temporary student or work visa holder who is in New Zealand.\n- This does not apply to partners, dependent children and legal guardians of, and who are traveling with:\nNew Zealand citizens or permanent resident visa holders; or\nNew Zealand resident visa holders where the resident visa was granted in New Zealand; or\nNew Zealand resident visa holders where the resident visa holder is arriving in New Zealand for a second or subsequent time where they are travelling with that New Zealand citizen or resident visa holder.\n- This does not apply to the following:\nessential health workers, as confirmed by the Ministry of Health; or\nother essential workers, as confirmed by the New Zealand Government; or\ncitizens of Samoa and Tonga making essential travel to New Zealand; or\npeople coming to New Zealand for humanitarian reasons.\n2. Nationals of New Zealand, permanent residents and residents with valid travel conditions and their immediate family, diplomats accredited to New Zealand and currently resident in New Zealand will be subject to self-isolation for 14 days."}, {"location": "Gibraltar", "data": "Passengers are not allowed to enter Gibraltar.\n- This does not apply to passengers with a British passport with nationality \"British Overseas Territories Citizen\" issued by Gibraltar.\n- This does not apply to passengers with a British passport born in Gibraltar.\n- This does not apply to British nationals with a national ID card issued by Gibraltar.\n- This does not apply to residents of Gibraltar.\n- This does not apply to merchant seamen with an Immigration pre-clearance letter issued by the Borders and Coastguards Agency.\n- This does not apply to nationals of Spain on their way to Spain.\n- This does not apply to residents of Spain on their way to Spain.\n- This does not apply to passengers who are taking up employment or carrying out a work activity in Gibraltar.\n- This does not apply to military personnel with a travel order issued by NATO or the United Kingdom.\n- This does not apply to passengers with an authorization letter issued by the Borders and Coastguards Agency."}, {"location": "Turkmenistan", "data": "1. Flights to Turkmenistan are suspended until 20 May 2020.\n- This does not apply to repatriation flights of nationals and residents of Turkmenistan.\n2. Passengers are required to have a health report from the health organizations of the country they are arriving from. The report must show that they have undergone the Coronavirus (COVID-19) check and been tested negative."}, {"location": "Cambodia", "data": "1. All visa exemptions, visas on arrival and e-visas are suspended until 30 April 2020.\n2. All foreigners must:\na. have a medical certificate, issued by competent health authorities of their country no more than 72 hours prior to the date of travel, certifying that they are not tested positive for the Coronavirus (COVID - 19); and\nb. have proof of insurance policy with minimum medical coverage of fifty thousand US dollars.\n- This does not apply to passengers with diplomatic visa (Visa A) or official visa (Visa B) issued by Cambodia.\n3. Passengers upon arrival will be subject to a health risk assessment and screened by the government. They will also be subject to a mandatory isolation/quarantine.\n4. Passengers arriving from France, Germany, Iran, Italy, Spain or USA are not allowed to enter Cambodia. \n- This does not apply to nationals and residents of Cambodia. \n5. Nationals and residents of Cambodia, diplomats and officials of foreign embassies and international organizations and their family members who have a Diplomatic Visa Type A and Official Visa Type B who live or have been in France, Germany, Iran, Italy, Spain or USA in the past 14 days will be quarantine for 14 days. \n- This does not apply to airline crew."}, {"location": "Norway", "data": "1. Passengers are not allowed to enter Norway. \n- This does not apply to nationals and residents of Norway. \n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and passengers with a British passport if they are residing or working in Norway. If they cannot prove their residency in Norway, they must be able to prove their nationality in one of the countries listed above.\n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and passengers with a British passport if they are transiting via Norway to return to their country of residence.\n- This does not apply to passengers with a visa issued by Norway after 15 March 2020.\n- This does not apply to airline crew. \n- This does not apply to passengers in transit. \n- This does not apply to passengers who have a particular responsibility to care for residents of Norway or who have strong welfare reasons. \n- This does not apply to the following passengers:\npassengers with a diplomatic or service passport when they are accredited to Norway;\npassengers with an ID card as diplomat or a Schengen residence card issued to diplomatic staff;\ntransit workers to oil platforms and similar;\nNATO staff with travel order;\npassengers with a valid flight certificate on duty;\nseamen in transit to or from ships;\nprofessional transporters of goods;\nmedia staff on duty;\ncruise passengers on cruises that started before 16 March 0800 CET transiting Norway to return home. \n2. The following passengers must undergo a 14-day home quarantine:\n- nationals and residents of Norway;\n- nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and passengers with a British passport if they are residing or working in Norway;\n- passengers who have a particular responsibility to care for residents of Norway or who have strong welfare reasons.\n3. All crew and passengers must fill out the public health information form and hand it over to the local airport authority upon arrival.\n4. Passengers are only allowed to travel to Svalbard after they have stayed in quarantined in other parts of Norway."}, {"location": "Seychelles", "data": "1. The international airport in Seychelles is closed to all international flights until 30 April 2020.\n- This does not apply to repatriation flights of foreign nationals from Seychelles.\n- This does not apply to emergency diversions.\n- This does not apply to special mission flights that are approved (MEDEVAC).\n2. Passengers are not allowed to enter Seychelles.\n- This does not apply to passengers who require to enter Seychelles on special mission and have a permission from the Public Health Commissioner before departure. \n- This does not apply to crew members requiring minimum rest. They must undergo strict mandatory quarantine during the rest period. \n- This does not apply to any other person under other circumstances as approved by the Public Health Commissioner."}, {"location": "Turkey", "data": "1. SAW airport is closed from 5 April 2020 to 30 April 2020.\n2. Nationals of Algeria, Angola, Austria, Azerbaijan, Bangladesh, Belgium, Bulgaria, Cameroon, Canada, Chad, China (People's Rep.), Colombia, Cote d'Ivoire, Czechia, Denmark, Djibouti, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, France, Georgia, Germany, Greece. Guatemala, Hungary, India, Iran, Iraq, Ireland (Rep.), Italy, Jordan, Kazakhstan, Kenya, Korea (Rep.), Kosovo, Kuwait, Latvia, Lebanon, Mauritania, Moldova, Mongolia, Montenegro, Morocco, Nepal, Netherlands, Niger, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Saudi Arabia, Slovenia, Spain, Sri Lanka, Sudan, Sweden, Switzerland, Tunisia, Ukraine, United Arab Emirates and Uzbekistan are not allowed to enter Turkey. \n3. Passengers with a British passport are not allowed to enter Turkey.\n4. Passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport are not allowed to enter Turkey.\n5. Passengers who have transited or have been in Algeria, Angola, Austria, Azerbaijan, Bangladesh, Belgium, Bulgaria, Cameroon, Canada, Chad, China (People's Rep.), Chinese Taipei, Colombia, Cote d'Ivoire, Czechia, Denmark, Djibouti, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, France, Georgia, Germany, Greece, Guatemala, Hungary, India, Iran, Iraq, Ireland (Rep.), Italy, Jordan, Kazakhstan, Kenya, Korea (Rep.), Kosovo, Kuwait, Latvia, Lebanon, Mauritania, Moldova, Mongolia, Montenegro, Morocco, Nepal, Netherlands, Niger, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Saudi Arabia, Slovenia, Spain, Sri Lanka, Sudan, Sweden, Switzerland, Tunisia, Ukraine, United Arab Emirates, United Kingdom or Uzbekistan in the past 14 days are not allowed to transit or enter Turkey. \n6. Passengers arriving from Algeria, Angola, Austria, Azerbaijan, Bangladesh, Belgium, Bulgaria, Cameroon, Canada, Chad, China (People's Rep.), Chinese Taipei, Colombia, Cote d'Ivoire, Czechia, Denmark, Djibouti, Dominica, Ecuador, Egypt, Equatorial Guinea, Finland, France, Georgia, Germany, Greece, Guatemala, Hungary, India, Iran, Iraq, Ireland (Rep.), Italy, Jordan, Kazakhstan, Kenya, Korea (Rep.), Kosovo, Kuwait, Latvia, Lebanon, Mauritania, Moldova, Mongolia, Montenegro, Morocco, Nepal, Netherlands, Niger, North Macedonia (Rep.), Norway, Oman, Panama, Peru, Philippines, Poland, Portugal, Saudi Arabia, Slovenia, Spain, Sri Lanka, Sudan, Sweden, Switzerland, Tunisia, Ukraine, United Arab Emirates, United Kingdom or Uzbekistan in the past 14 days are not allowed to transit or enter Turkey.\n7. All passengers who traveled to the above restricted countries during the last 14 days are prohibited to be accepted to all flights to Turkey. Otherwise, all passengers on the flights will be quarantined for 14 days."}, {"location": "Spain", "data": "Passengers are not allowed to enter Spain until 23 April 2020. \n-This does not apply to:\na) When arriving from a European Union or Schengen member state\nb) Nationals and residents of a European Union or Schengen member state, who go directly to their place of residence;\nc) Holders of a long-term visa issued by a European Union or Schengen member state who travel to the country that issued the visa;\nd) Cross-border workers;\ne) Healthcare or elderly care professionals in the performance of their duties;\nf) Transport of goods personnel;\ng) Diplomats, international organizations, military personnel and members of humanitarian organizations in the performance of their duties;\nh) People traveling for imperative family reasons duly accredited.\ni) Persons who documentary reasons of force majeure or situation of need, or whose entry is permitted for humanitarian reasons."}, {"location": "Kazakhstan", "data": "1. Passengers are not allowed to enter and exit from/to Kazakhstan until further notice (official source http://www.mfa.kz/en/).\n- This does not apply to nationals of Kazakhstan, who left the country – upon their return. \n- This does not apply to nationals of Kazakhstan, who travelling abroad for treatment – supporting documents from medical institutes are required.\n- This does not apply to foreigners departing from Kazakhstan \n- This does not apply to staff of the diplomatic service of Kazakhstan and foreign states and members of their families, as well as members of delegations of foreign states and international organizations traveling to Kazakhstan at the invitation of the Ministry of Foreign Affairs of the Republic of Kazakhstan;\n- This does not apply to crewmembers of train, locomotive, aircraft and sea crews;\n- This does not apply to service personnel of foreign cross-border facilities on the territory of Kazakhstan and service personnel of Kazakh cross-border facilities on the territory of neighboring states; \n- This does not apply to foreigners (stateless persons), holders of Kazakh residence permits;\n- This does not apply to foreigners who are family members of citizens of Kazakhstan (subject to confirmation of kinship – spouses, parents and children).\n2. All airports are closed for international flights until 30 April 2020.\n- This does not apply to state flights, ferry flights, sanitary flights or technical landing for refuel."}, {"location": "Czech Republic", "data": "Passengers are not allowed to enter Czechia.\n- This does not apply to nationals of Czechia.\n- This does not apply to passengers with a Czech residence permit for stay over 90 days or for permanent stay.\n- This does not apply to passengers with a Czech long-stay visa (not including visa stickers with a national comment D/VR/XX).\n- This does not apply to passengers with diplomatic and service passports issued by Czechia. \n- This does not apply to passengers who are younger than 18 years of age and who are nationals of Czechia or another EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom. A birth certificate or its copy must be presented. In case the child is not a national of EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom or a national of EU visa free country, visa or residence permit must be presented. \n- This does not apply to members of the mission under the Vienna Convention on Diplomatic Relations and members of the consular posts under the Vienna Convention on Consular Relations accredited in Czechia, and officials of international organizations based in Czechia registered with Ministry of the Foreign Affairs of Czechia, including their family members.\n- This does not apply to passengers who are spouses of nationals of Czechia or of nationals of another EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom. A marriage certificate or its copy must be presented. In case the spouse is not a national of EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom or a national of EU visa free country, visa or residence permit must be presented.\n- This does not apply to passengers who are nationals of another EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom, with an official confirmation by an embassy of their home state or by an embassy of Czechia confirming acceptance to a flight for the purpose of repatriation to their home state and an organized transfer or their intention to transfer from the territory of Czechia to their home state.\n- This does not apply to passengers with a long-stay visa, residence permit for stay over 90 days or for permanent stay in another EU Member State, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom, with an official confirmation by an embassy of the state which issued their residence permit or by an embassy of Czechia confirming acceptance to a flight for the purpose of repatriation and to an organized transfer or their intention to transfer from the territory of Czechia to their country of origin.\n- This does not apply to nationals of EU Member States, Iceland, Liechtenstein, Norway, Switzerland or United Kingdom residing in Czechia who have been accepted into a special repatriation flight organized by the Ministry of Foreign Affairs of Czechia or another state with one of the following documents:\n- European Health Insurance Card issued by Czechia,\n- document confirming residence in Czechia such as lease contract,\n- employment contract with the place of work in Czechia;\n- confirmation of study in Czechia."}, {"location": "Georgia", "data": "1. Passengers are not allowed to enter Georgia.\n- This does not apply to nationals and residents of Georgia.\n- This does not apply to airline crew.\n- This does not apply to representatives of diplomatic missions and international organizations and their family members accredited to Georgia.\n- This does not apply to mixed families where one of the spouses or their under age child is a citizen of Georgia.\n- This does not apply to passengers who are part of the humanitarian mission if trip of such mission (doctors, volunteers) becomes a necessity. \n- This does not apply to passengers who have been granted the status of stateless persons by respective authorities of Georgia.\n- This does not apply to passengers who are holding status neutral travel documents.\n- This does not apply to passengers with a refugee status in Georgia.\n2. Passengers with a residence permit issued by Georgia must get an OKTOBOARD before departing for Georgia."}, {"location": "Sweden", "data": "Passengers arriving from outside Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Switzerland and United Kingdom are not allowed to enter.\n- This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland, and their family members.\n- This does not apply to passengers with a British passport and their family members.\n- This does not apply to passengers with a residence permit issued by Sweden. \n- This does not apply to passengers with a national visa issued by Sweden. \n- This does not apply to the following passengers:\na. healthcare personnel;\nb. border workers;\nc. personnel transporting goods and other personnel in the transport sector to the necessary extent;\nd. persons covered by Chapter 2. Section 10 of the Aliens Act (2005: 716);\ne. persons working in international organizations, military personnel and relief workers;\nf. passengers in transit; \ng. persons with urgent family reasons;\nh. persons in need of international protection or for other humanitarian reasons."}, {"location": "Turks and Caicos Islands", "data": "1. Passengers who have been in Austria, Belgium, Czechia, China (People's Rep.), Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Macao (SAR China), Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Singapore or Vatican City in the past 21 days are not allowed to enter Turks and Caicos.\n- This does not apply to nationals and residents of Turks and Caicos.\n2. Nationals and residents of Turks and Caicos who have been in Austria, Belgium, Czechia, China (People's Rep.), Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Italy, Japan, Korea (Rep.), Latvia, Liechtenstein, Lithuania, Luxembourg, Macao (SAR China), Malta, Monaco, Netherlands, Norway, Poland, Portugal, San Marino, Slovakia, Slovenia, Spain, Sweden, Switzerland, Singapore or Vatican City in the past 21 days are subject to quarantine for 14 days."}, {"location": "Solomon Islands", "data": "1. Passengers who have transited through or have been in Austria, Bahrain, Belgium, China (People's Rep.), Chinese Taipei, Denmark, France, Germany, Greece, Hong Kong (SAR China), Indonesia, Iran, Israel, Italy, Japan, Korea (Rep.), Kuwait, Macao (SAR China), Malaysia, Netherlands, Norway, Qatar, Singapore, Spain, Sweden, Switzerland or Thailand in the past 14 days are not allowed to enter Solomon Isl.\n\n- This does not apply to nationals of Solomon Isl.\n\n2. Passengers who have transited through or have been in Afghanistan, Algeria, Andorra, Argentina, Armenia, Australia, Azerbaijan, Bangladesh, Belarus, Bhutan, Bolivia, Bosnia and Herzegovina, Brazil, Brunei Darussalam, Bulgaria, Burkina Faso, Cambodia, Cameroon, Canada, Chile, Colombia, Congo (Dem. Rep.), Costa Rica, Cote d'Ivoire, Cyprus, Czechia, Dominican Rep., Ecuador, Egypt, Estonia, Finland, French Guiana, French Polynesia, Georgia, Gibraltar, Honduras, Hungary, Iceland, India, Ireland (Rep.), Jamaica, Jordan, Latvia, Lebanon, Liechtenstein, Lithuania, Luxembourg, Maldives, Mexico, Moldova (Rep.), Monaco, Mongolia, Morocco, Nepal, New Zealand, Nigeria, North Macedonia (Rep.), Oman, Pakistan, Palestinian Territory, Panama, Paraguay, Peru, Philippines, Poland, Portugal, Romania, Russian Fed., San Marino, Saudi Arabia, Senegal, Serbia, Sierra Leone, Slovenia, South Africa, Sri Lanka, Togo, Turkey, USA, Ukraine, United Arab Emirates, United Kingdom, Vatican City (Holy See) or Viet Nam in the past 14 days may be subject to immediate quarantine or isolation as applicable."}, {"location": "United States of America", "data": "1. Passengers who have transited or have been in Austria, Belgium, China (People's Rep.), Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Iran, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland or in the United Kingdom (excluding overseas territories outside of Europe), in the past 14 days are not allowed to enter the USA.\n-This does not apply to:\na. nationals of the USA;\nb. permanent residents of the USA;\nc. passengers arriving in the US on flights that departed before 23:59 EDT on 13 March 2020;\nd. the spouse of a national of the USA;\ne. the souse of a permanent resident of the US;\nf. the parent/legal guardian of an unmarried and younger than 21 years national or permanent resident of the USA;\ng. the unmarried and younger than 21 years brother or sister of a national or permanent resident of the USA, who is unmarried and younger than 21 years;\nh. the child/foster child/ward of a national or permanent resident of the USA;\ni. passengers with an IR-4 or IH-4 visa;\nj. passengers with a C-1, D, or C-1/D visa;\nk. passengers with an A-1, A-2, C-2, C-3, E-1, G-1, G-2, G-3, G-4, NATO-1 through NATO-4, or NATO-6 visa;\nl. members of the U.S. Armed Forces, spouses, and children of members of the U.S. Armed Forces;\nm. passengers with evidence of traveling at the invitation of the USA government for a purpose related to the containment/mitigation of the Coronavirus (COVID-19);\nn. passengers with documents issued by the U.S. Department of Homeland Security, U.S. Customs and Border Protection, or U.S. Department of State indicating that the passenger is exempt from the restriction.\n2. Passengers who have been in one of the countries listed in bullet number 1 in the past 14 days but are exempt from the restriction to enter the USA, must arrive at one of the following airports: Atlanta (ATL), Boston (BOS), Chicago (ORD), Dallas, (DFW), Detroit (DTW), Honolulu (HNL), Los Angeles (LAX), Miami (MIA), New York (JFK or EWR), San Francisco (SFO), Seattle (SEA) and Washington (IAD)."}]}